nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
#define CLKCTL3_PSCCTL0_COMP_MU2_MASK            (0x40U)
#define CLKCTL3_PSCCTL0_COMP_MU2_SHIFT           (6U)
/*! MU2 - MU2 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_MU2(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_MU2_SHIFT)) & CLKCTL3_PSCCTL0_COMP_MU2_MASK)

#define CLKCTL3_PSCCTL0_COMP_OSTIMER_MASK        (0x80U)
#define CLKCTL3_PSCCTL0_COMP_OSTIMER_SHIFT       (7U)
/*! OSTIMER - OSTIMER Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_OSTIMER(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_OSTIMER_SHIFT)) & CLKCTL3_PSCCTL0_COMP_OSTIMER_MASK)

#define CLKCTL3_PSCCTL0_COMP_SEMA42_0_MASK       (0x100U)
#define CLKCTL3_PSCCTL0_COMP_SEMA42_0_SHIFT      (8U)
/*! SEMA42_0 - SEMA42_0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_SEMA42_0(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_SEMA42_0_SHIFT)) & CLKCTL3_PSCCTL0_COMP_SEMA42_0_MASK)

#define CLKCTL3_PSCCTL0_COMP_SDADC0_MASK         (0x200U)
#define CLKCTL3_PSCCTL0_COMP_SDADC0_SHIFT        (9U)
/*! SDADC0 - SDADC0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_SDADC0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_SDADC0_SHIFT)) & CLKCTL3_PSCCTL0_COMP_SDADC0_MASK)

#define CLKCTL3_PSCCTL0_COMP_SARADC0_MASK        (0x400U)
#define CLKCTL3_PSCCTL0_COMP_SARADC0_SHIFT       (10U)
/*! SARADC0 - ADC0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_SARADC0(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_SARADC0_SHIFT)) & CLKCTL3_PSCCTL0_COMP_SARADC0_MASK)

#define CLKCTL3_PSCCTL0_COMP_ACMP0_MASK          (0x800U)
#define CLKCTL3_PSCCTL0_COMP_ACMP0_SHIFT         (11U)
/*! ACMP0 - ACMP0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_ACMP0(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_ACMP0_SHIFT)) & CLKCTL3_PSCCTL0_COMP_ACMP0_MASK)

#define CLKCTL3_PSCCTL0_COMP_MICFIL_MASK         (0x1000U)
#define CLKCTL3_PSCCTL0_COMP_MICFIL_SHIFT        (12U)
/*! MICFIL - MICFIL Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_MICFIL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_MICFIL_SHIFT)) & CLKCTL3_PSCCTL0_COMP_MICFIL_MASK)

#define CLKCTL3_PSCCTL0_COMP_GLIKEY4_MASK        (0x2000U)
#define CLKCTL3_PSCCTL0_COMP_GLIKEY4_SHIFT       (13U)
/*! GLIKEY4 - GLIKEY4 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_GLIKEY4(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_GLIKEY4_SHIFT)) & CLKCTL3_PSCCTL0_COMP_GLIKEY4_MASK)

#define CLKCTL3_PSCCTL0_COMP_DBG_RT700_MASK      (0x100000U)
#define CLKCTL3_PSCCTL0_COMP_DBG_RT700_SHIFT     (20U)
/*! DBG_RT700 - DBG_RT700 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_DBG_RT700(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_DBG_RT700_SHIFT)) & CLKCTL3_PSCCTL0_COMP_DBG_RT700_MASK)

#define CLKCTL3_PSCCTL0_COMP_SYSCON3_MASK        (0x200000U)
#define CLKCTL3_PSCCTL0_COMP_SYSCON3_SHIFT       (21U)
/*! SYSCON3 - SYSCON3 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_SYSCON3(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_SYSCON3_SHIFT)) & CLKCTL3_PSCCTL0_COMP_SYSCON3_MASK)

#define CLKCTL3_PSCCTL0_COMP_IOPCTL1_MASK        (0x400000U)
#define CLKCTL3_PSCCTL0_COMP_IOPCTL1_SHIFT       (22U)
/*! IOPCTL1 - IOPCTL1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_IOPCTL1(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_IOPCTL1_SHIFT)) & CLKCTL3_PSCCTL0_COMP_IOPCTL1_MASK)

#define CLKCTL3_PSCCTL0_COMP_GLIKEY1_MASK        (0x800000U)
#define CLKCTL3_PSCCTL0_COMP_GLIKEY1_SHIFT       (23U)
/*! GLIKEY1 - GLIKEY1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_GLIKEY1(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_GLIKEY1_SHIFT)) & CLKCTL3_PSCCTL0_COMP_GLIKEY1_MASK)

#define CLKCTL3_PSCCTL0_COMP_LPI2C15_MASK        (0x1000000U)
#define CLKCTL3_PSCCTL0_COMP_LPI2C15_SHIFT       (24U)
/*! LPI2C15 - LPI2C15 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_LPI2C15(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_LPI2C15_SHIFT)) & CLKCTL3_PSCCTL0_COMP_LPI2C15_MASK)

#define CLKCTL3_PSCCTL0_COMP_MEDIA_ACCESS_RAM_ARBITER1_MASK (0x2000000U)
#define CLKCTL3_PSCCTL0_COMP_MEDIA_ACCESS_RAM_ARBITER1_SHIFT (25U)
/*! MEDIA_ACCESS_RAM_ARBITER1 - Media Access RAM Arbiter1 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL3_PSCCTL0_COMP_MEDIA_ACCESS_RAM_ARBITER1(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_MEDIA_ACCESS_RAM_ARBITER1_SHIFT)) & CLKCTL3_PSCCTL0_COMP_MEDIA_ACCESS_RAM_ARBITER1_MASK)
/*! @} */

/*! @name PSCCTL0_COMP_SET - VDD1_SENSE Peripheral Clock Control 0 Set */
/*! @{ */

#define CLKCTL3_PSCCTL0_COMP_SET_CPU1_MASK       (0x1U)
#define CLKCTL3_PSCCTL0_COMP_SET_CPU1_SHIFT      (0U)
/*! CPU1 - CPU1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_SET_CPU1(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_SET_CPU1_SHIFT)) & CLKCTL3_PSCCTL0_COMP_SET_CPU1_MASK)

#define CLKCTL3_PSCCTL0_COMP_SET_MU0_MASK        (0x10U)
#define CLKCTL3_PSCCTL0_COMP_SET_MU0_SHIFT       (4U)
/*! MU0 - MU0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_SET_MU0(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_SET_MU0_SHIFT)) & CLKCTL3_PSCCTL0_COMP_SET_MU0_MASK)

#define CLKCTL3_PSCCTL0_COMP_SET_MU1_MASK        (0x20U)
#define CLKCTL3_PSCCTL0_COMP_SET_MU1_SHIFT       (5U)
/*! MU1 - MU1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_SET_MU1(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_SET_MU1_SHIFT)) & CLKCTL3_PSCCTL0_COMP_SET_MU1_MASK)

#define CLKCTL3_PSCCTL0_COMP_SET_MU2_MASK        (0x40U)
#define CLKCTL3_PSCCTL0_COMP_SET_MU2_SHIFT       (6U)
/*! MU2 - MU2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_SET_MU2(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_SET_MU2_SHIFT)) & CLKCTL3_PSCCTL0_COMP_SET_MU2_MASK)

