nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
#define CLKCTL4_LCDIFPIXELCLKDIV_HALT_MASK       (0x40000000U)
#define CLKCTL4_LCDIFPIXELCLKDIV_HALT_SHIFT      (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_LCDIFPIXELCLKDIV_HALT(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LCDIFPIXELCLKDIV_HALT_SHIFT)) & CLKCTL4_LCDIFPIXELCLKDIV_HALT_MASK)

#define CLKCTL4_LCDIFPIXELCLKDIV_REQFLAG_MASK    (0x80000000U)
#define CLKCTL4_LCDIFPIXELCLKDIV_REQFLAG_SHIFT   (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_LCDIFPIXELCLKDIV_REQFLAG(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LCDIFPIXELCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_LCDIFPIXELCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name LOWFREQCLKDIV - Low frequency Clock Divider */
/*! @{ */

#define CLKCTL4_LOWFREQCLKDIV_DIV_MASK           (0xFFFFU)
#define CLKCTL4_LOWFREQCLKDIV_DIV_SHIFT          (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL4_LOWFREQCLKDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LOWFREQCLKDIV_DIV_SHIFT)) & CLKCTL4_LOWFREQCLKDIV_DIV_MASK)

#define CLKCTL4_LOWFREQCLKDIV_BUSY_MASK          (0x10000000U)
#define CLKCTL4_LOWFREQCLKDIV_BUSY_SHIFT         (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL4_LOWFREQCLKDIV_BUSY(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LOWFREQCLKDIV_BUSY_SHIFT)) & CLKCTL4_LOWFREQCLKDIV_BUSY_MASK)

#define CLKCTL4_LOWFREQCLKDIV_RESET_MASK         (0x20000000U)
#define CLKCTL4_LOWFREQCLKDIV_RESET_SHIFT        (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL4_LOWFREQCLKDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LOWFREQCLKDIV_RESET_SHIFT)) & CLKCTL4_LOWFREQCLKDIV_RESET_MASK)

#define CLKCTL4_LOWFREQCLKDIV_HALT_MASK          (0x40000000U)
#define CLKCTL4_LOWFREQCLKDIV_HALT_SHIFT         (30U)
/*! HALT - Divider Counter Halt
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL4_LOWFREQCLKDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LOWFREQCLKDIV_HALT_SHIFT)) & CLKCTL4_LOWFREQCLKDIV_HALT_MASK)

#define CLKCTL4_LOWFREQCLKDIV_REQFLAG_MASK       (0x80000000U)
#define CLKCTL4_LOWFREQCLKDIV_REQFLAG_SHIFT      (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL4_LOWFREQCLKDIV_REQFLAG(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_LOWFREQCLKDIV_REQFLAG_SHIFT)) & CLKCTL4_LOWFREQCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name PSCCTL0_SENS - VDD1_SENSE Media Peripheral Clock Control 0 */
/*! @{ */

#define CLKCTL4_PSCCTL0_SENS_VGPU_MASK           (0x4U)
#define CLKCTL4_PSCCTL0_SENS_VGPU_SHIFT          (2U)
/*! VGPU - VGPU Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_VGPU(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_VGPU_SHIFT)) & CLKCTL4_PSCCTL0_SENS_VGPU_MASK)

#define CLKCTL4_PSCCTL0_SENS_MIPI_DSI_HOST_MASK  (0x10U)
#define CLKCTL4_PSCCTL0_SENS_MIPI_DSI_HOST_SHIFT (4U)
/*! MIPI_DSI_HOST - MIPI_DSI_HOST Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_MIPI_DSI_HOST(x)    (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_MIPI_DSI_HOST_SHIFT)) & CLKCTL4_PSCCTL0_SENS_MIPI_DSI_HOST_MASK)

#define CLKCTL4_PSCCTL0_SENS_LPSPI16_MASK        (0x20U)
#define CLKCTL4_PSCCTL0_SENS_LPSPI16_SHIFT       (5U)
/*! LPSPI16 - LPSPT16 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_LPSPI16(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_LPSPI16_SHIFT)) & CLKCTL4_PSCCTL0_SENS_LPSPI16_MASK)

#define CLKCTL4_PSCCTL0_SENS_LPSPI14_MASK        (0x40U)
#define CLKCTL4_PSCCTL0_SENS_LPSPI14_SHIFT       (6U)
/*! LPSPI14 - LPSPI14 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_LPSPI14(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_LPSPI14_SHIFT)) & CLKCTL4_PSCCTL0_SENS_LPSPI14_MASK)

#define CLKCTL4_PSCCTL0_SENS_XSPI2_MASK          (0x100U)
#define CLKCTL4_PSCCTL0_SENS_XSPI2_SHIFT         (8U)
/*! XSPI2 - XSPI2 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_XSPI2(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_XSPI2_SHIFT)) & CLKCTL4_PSCCTL0_SENS_XSPI2_MASK)

#define CLKCTL4_PSCCTL0_SENS_MMU2_MASK           (0x800U)
#define CLKCTL4_PSCCTL0_SENS_MMU2_SHIFT          (11U)
/*! MMU2 - MMU2 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_MMU2(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_MMU2_SHIFT)) & CLKCTL4_PSCCTL0_SENS_MMU2_MASK)

#define CLKCTL4_PSCCTL0_SENS_GLIKEY5_MASK        (0x2000U)
#define CLKCTL4_PSCCTL0_SENS_GLIKEY5_SHIFT       (13U)
/*! GLIKEY5 - GLIKEY5 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_GLIKEY5(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_GLIKEY5_SHIFT)) & CLKCTL4_PSCCTL0_SENS_GLIKEY5_MASK)

#define CLKCTL4_PSCCTL0_SENS_FLEXIO0_MASK        (0x8000U)
#define CLKCTL4_PSCCTL0_SENS_FLEXIO0_SHIFT       (15U)
/*! FLEXIO0 - FLEXIO0 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_FLEXIO0(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_FLEXIO0_SHIFT)) & CLKCTL4_PSCCTL0_SENS_FLEXIO0_MASK)

#define CLKCTL4_PSCCTL0_SENS_LCDIF_MASK          (0x400000U)
#define CLKCTL4_PSCCTL0_SENS_LCDIF_SHIFT         (22U)
/*! LCDIF - LCDIF Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_LCDIF(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_LCDIF_SHIFT)) & CLKCTL4_PSCCTL0_SENS_LCDIF_MASK)

#define CLKCTL4_PSCCTL0_SENS_SYSCON4_MASK        (0x800000U)
#define CLKCTL4_PSCCTL0_SENS_SYSCON4_SHIFT       (23U)
/*! SYSCON4 - SYSCON4 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_SYSCON4(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_SYSCON4_SHIFT)) & CLKCTL4_PSCCTL0_SENS_SYSCON4_MASK)

#define CLKCTL4_PSCCTL0_SENS_JPEGDEC_MASK        (0x1000000U)
#define CLKCTL4_PSCCTL0_SENS_JPEGDEC_SHIFT       (24U)
/*! JPEGDEC - JPEGDEC Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_JPEGDEC(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_JPEGDEC_SHIFT)) & CLKCTL4_PSCCTL0_SENS_JPEGDEC_MASK)

#define CLKCTL4_PSCCTL0_SENS_PNGDEC_MASK         (0x2000000U)
#define CLKCTL4_PSCCTL0_SENS_PNGDEC_SHIFT        (25U)
/*! PNGDEC - PNGDEC Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_PNGDEC(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_PNGDEC_SHIFT)) & CLKCTL4_PSCCTL0_SENS_PNGDEC_MASK)

#define CLKCTL4_PSCCTL0_SENS_EZHV_MASK           (0x4000000U)
#define CLKCTL4_PSCCTL0_SENS_EZHV_SHIFT          (26U)
/*! EZHV - EZHV Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_EZHV(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_EZHV_SHIFT)) & CLKCTL4_PSCCTL0_SENS_EZHV_MASK)

#define CLKCTL4_PSCCTL0_SENS_AXBS_EZH_MASK       (0x10000000U)
#define CLKCTL4_PSCCTL0_SENS_AXBS_EZH_SHIFT      (28U)
/*! AXBS_EZH - AXBS for EZHV Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_AXBS_EZH(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_AXBS_EZH_SHIFT)) & CLKCTL4_PSCCTL0_SENS_AXBS_EZH_MASK)

#define CLKCTL4_PSCCTL0_SENS_GLIKEY2_MASK        (0x20000000U)
#define CLKCTL4_PSCCTL0_SENS_GLIKEY2_SHIFT       (29U)
/*! GLIKEY2 - GLIKEY2 Clock
 *  0b1..Enable
 *  0b0..Disable
 */
#define CLKCTL4_PSCCTL0_SENS_GLIKEY2(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL4_PSCCTL0_SENS_GLIKEY2_SHIFT)) & CLKCTL4_PSCCTL0_SENS_GLIKEY2_MASK)
/*! @} */

/*! @name PSCCTL1_SENS - VDD1_SENSE Media Peripheral Clock Control 1 */
/*! @{ */

