nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
/* The count of INPUTMUX_PINT1_TRIG */
#define INPUTMUX_PINT1_TRIG_COUNT                (4U)

/*! @name HIFI1_INTERRUPT - HiFi1 Interrupt Connections */
/*! @{ */

#define INPUTMUX_HIFI1_INTERRUPT_TRIGIN_MASK     (0x3FU)
#define INPUTMUX_HIFI1_INTERRUPT_TRIGIN_SHIFT    (0U)
/*! TRIGIN - HiFi1 input interrupt
 *  0b000000..Selects LP_FLEXCOMM17 interrupt
 *  0b000001..Selects LP_FLEXCOMM18 interrupt
 *  0b000010..Selects LP_FLEXCOMM19 interrupt
 *  0b000011..Selects LP_FLEXCOMM20 interrupt
 *  0b000100..Selects PMC1 Interrupt
 *  0b000111..Selects GPIO8 channel 0 interrupt
 *  0b001000..Selects GPIO8 channel 1 interrupt
 *  0b001001..Selects GPIO9 channel 0 interrupt
 *  0b001010..Selects GPIO9 channel 1 interrupt
 *  0b001011..Selects GPIO10 channel 0 interrupt
 *  0b001100..Selects GPIO10 channel 1 interrupt
 *  0b001101..Selects WWDT2 interrupt
 *  0b001110..Selects WWDT3 interrupt
 *  0b001111..Selects MU0_MUB interrupt for HiFi1 to CPU0
 *  0b010000..Selects MU3_MUB interrupt for HiFi1 to CPU1
 *  0b010001..Selects UTICK1 interrupt
 *  0b010010..Selects MRT1 Ored interrupt
 *  0b010011..Selects OSTIMER event timer HiFi1 wakeup/interrupt
 *  0b010100..Selects CTIMER5 interrupt
 *  0b010101..Selects CTIMER6 interrupt
 *  0b010110..Selects CTIMER7 interrupt
 *  0b010111..Selects RTC1 alarm interrupt to Sense domain
 *  0b011000..Selects RTC_SS1 wakeup interrupt to Sense domain
 *  0b011001..Selects I3C2 interrupt
 *  0b011010..Selects I3C3 interrupt
 *  0b011011..Selects MICFIL interrupt for read data or error
 *  0b011100..Selects MICFIL hardware voice activity detector interrupt or error interrupt
 *  0b100010..Selects eDMA2 channel 0 interrupt
 *  0b100011..Selects eDMA2 channel 1 interrupt
 *  0b100100..Selects eDMA2 channel 2 interrupt
 *  0b100101..Selects eDMA2 channel 3 interrupt
 *  0b100110..Selects eDMA2 channel 4 interrupt
 *  0b100111..Selects eDMA2 channel 5 interrupt
 *  0b101000..Selects eDMA2 channel 6 interrupt
 *  0b101001..Selects eDMA2 channel 7 interrupt
 *  0b101010..Selects eDMA3 channel 0 interrupt
 *  0b101011..Selects eDMA3 channel 1 interrupt
 *  0b101100..Selects eDMA3 channel 2 interrupt
 *  0b101101..Selects eDMA3 channel 3 interrupt
 *  0b101110..Selects eDMA3 channel 4 interrupt
 *  0b101111..Selects eDMA3 channel 5 interrupt
 *  0b110000..Selects eDMA3 channel 6 interrupt
 *  0b110001..Selects eDMA3 channel 7 interrupt
 *  0b110010..Selects PINT1 interrupt 0
 *  0b110011..Selects PINT1 interrupt 1
 *  0b110100..Selects PINT1 interrupt 2
 *  0b110101..Selects PINT1 interrupt 3
 *  0b110110..Selects SAI3 TX/RX interrupt
 *  *..
 */
#define INPUTMUX_HIFI1_INTERRUPT_TRIGIN(x)       (((uint32_t)(((uint32_t)(x)) << INPUTMUX_HIFI1_INTERRUPT_TRIGIN_SHIFT)) & INPUTMUX_HIFI1_INTERRUPT_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX_HIFI1_INTERRUPT */
#define INPUTMUX_HIFI1_INTERRUPT_COUNT           (27U)

/*! @name FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG - LP_FLEXCOMM Input Connections */
/*! @{ */

#define INPUTMUX_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_TRIGIN_MASK (0xFU)
#define INPUTMUX_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_TRIGIN_SHIFT (0U)
/*! TRIGIN - LP_FLEXCOMM Input Trigger
 *  0b0000..Selects CTIMER_S_INP0
 *  0b0001..Selects CTIMER_S_INP1
 *  0b0010..Selects CTIMER_S_INP2
 *  0b0011..Selects CTIMER_S_INP3
 *  0b0111..Selects CTIMER5_MAT3
 *  0b1000..Selects CTIMER6_MAT3
 *  0b1001..Selects CTIMER7_MAT3
 *  0b1100..Selects PINT1 boolean pattern-match output
 *  0b1101..Selects ACMP0 CMPO
 *  0b1110..Selects RTC_SS1 Interrupt
 *  *..
 */
#define INPUTMUX_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_TRIGIN(x) (((uint32_t)(((uint32_t)(x)) << INPUTMUX_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_TRIGIN_SHIFT)) & INPUTMUX_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG */
#define INPUTMUX_FLEXCOMM_TRIG_LP_FLEXCOMM_TRIG_COUNT (4U)

/*! @name ADC_TRIG_ADC0_TRIG - ADC0 Input Connections */
/*! @{ */

#define INPUTMUX_ADC_TRIG_ADC0_TRIG_TRIGIN_MASK  (0x1FU)
#define INPUTMUX_ADC_TRIG_ADC0_TRIG_TRIGIN_SHIFT (0U)
/*! TRIGIN - ADC0 Input Trigger
 *  0b00000..Selects GPIO0 peripheral output channel 0 trigger
 *  0b00001..Selects GPIO1 peripheral output channel 0 trigger
 *  0b00010..Selects GPIO2 peripheral output channel 0 trigger
 *  0b00011..Selects GPIO3 peripheral output channel 0 trigger
 *  0b00100..Selects GPIO4 peripheral output channel 0 trigger
 *  0b00101..Selects GPIO5 peripheral output channel 0 trigger
 *  0b00110..Selects GPIO6 peripheral output channel 0 trigger
 *  0b00111..Selects GPIO7 peripheral output channel 0 trigger
 *  0b01000..Selects GPIO8 peripheral output channel 0 trigger
 *  0b01001..Selects GPIO9 peripheral output channel 0 trigger
 *  0b01010..Selects GPIO10 peripheral output channel 0 trigger
 *  0b01011..Selects SCT0_OUT4
 *  0b01100..Selects SCT0_OUT5
 *  0b01101..Selects SCT0_OUT9
 *  0b01110..Selects CTIMER0_MAT3
 *  0b01111..Selects CTIMER1_MAT3
 *  0b10000..Selects CTIMER2_MAT3
 *  0b10001..Selects CTIMER3_MAT3
 *  0b10010..Selects CTIMER4_MAT3
 *  0b10011..Selects CTIMER5_MAT3
 *  0b10100..Selects CTIMER6_MAT3
 *  0b10101..Selects CTIMER7_MAT3
 *  0b10110..Selects ACMP0 CMPO
 *  0b10111..Selects CPU0 TXEV
 *  0b11000..Selects CPU1 TXEV
 *  0b11001..Selects EZH-V trigger out channel 0
 *  0b11010..Selects PINT0 boolean pattern-match output
 *  0b11011..Selects PINT1 boolean pattern-match output
 *  *..
 */
#define INPUTMUX_ADC_TRIG_ADC0_TRIG_TRIGIN(x)    (((uint32_t)(((uint32_t)(x)) << INPUTMUX_ADC_TRIG_ADC0_TRIG_TRIGIN_SHIFT)) & INPUTMUX_ADC_TRIG_ADC0_TRIG_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX_ADC_TRIG_ADC0_TRIG */
#define INPUTMUX_ADC_TRIG_ADC0_TRIG_COUNT        (2U)

/*! @name CTIMER_CTIMER_CAP_CAP - CTIMER Input Connections */
/*! @{ */

#define INPUTMUX_CTIMER_CTIMER_CAP_CAP_CAPIN_MASK (0x1FU)
#define INPUTMUX_CTIMER_CTIMER_CAP_CAP_CAPIN_SHIFT (0U)
/*! CAPIN - CTIMER Input Capture
 *  0b00000..Selects CTIMER_S_INP0
 *  0b00001..Selects CTIMER_S_INP1
 *  0b00010..Selects CTIMER_S_INP2
 *  0b00011..Selects CTIMER_S_INP3
 *  0b00100..Selects CTIMER_S_INP4
 *  0b00101..Selects CTIMER_S_INP5
 *  0b00110..Selects CTIMER_S_INP6
 *  0b00111..Selects CTIMER_S_INP7
 *  0b01000..Selects CTIMER_S_INP8
 *  0b01001..Selects CTIMER_S_INP9
 *  0b10000..Selects SAI3_TX_SYNC
 *  0b10001..Selects SAI3_RX_SYNC
 *  0b10010..Selects ACMP0 CMPO
 *  0b10011..Selects ADC0 trigger completion flag 0
 *  0b10100..Selects ADC0 trigger completion flag 1
 *  *..
 */
#define INPUTMUX_CTIMER_CTIMER_CAP_CAP_CAPIN(x)  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_CTIMER_CTIMER_CAP_CAP_CAPIN_SHIFT)) & INPUTMUX_CTIMER_CTIMER_CAP_CAP_CAPIN_MASK)
/*! @} */

/* The count of INPUTMUX_CTIMER_CTIMER_CAP_CAP */
#define INPUTMUX_CTIMER_CTIMER_CAP_CAP_COUNT     (3U)

/* The count of INPUTMUX_CTIMER_CTIMER_CAP_CAP */
#define INPUTMUX_CTIMER_CTIMER_CAP_CAP_COUNT2    (4U)

/*! @name CTIMER_TRIG - CTIMER Input Connections */
/*! @{ */

#define INPUTMUX_CTIMER_TRIG_TRIGIN_MASK         (0x1FU)
#define INPUTMUX_CTIMER_TRIG_TRIGIN_SHIFT        (0U)
/*! TRIGIN - CTIMER Input Trigger
 *  0b00000..Selects CTIMER_S_INP0
 *  0b00001..Selects CTIMER_S_INP1
 *  0b00010..Selects CTIMER_S_INP2
 *  0b00011..Selects CTIMER_S_INP3
 *  0b00100..Selects CTIMER_S_INP4
 *  0b00101..Selects CTIMER_S_INP5
 *  0b00110..Selects CTIMER_S_INP6
 *  0b00111..Selects CTIMER_S_INP7
 *  0b01000..Selects CTIMER_S_INP8
 *  0b01001..Selects CTIMER_S_INP9
 *  0b10000..Selects SAI3_TX_SYNC
 *  0b10001..Selects SAI3_RX_SYNC
 *  0b10010..Selects ACMP0 CMPO
 *  0b10011..Selects ADC0 trigger completion flag 0
 *  0b10100..Selects ADC0 trigger completion flag 1
 *  *..
 */
#define INPUTMUX_CTIMER_TRIG_TRIGIN(x)           (((uint32_t)(((uint32_t)(x)) << INPUTMUX_CTIMER_TRIG_TRIGIN_SHIFT)) & INPUTMUX_CTIMER_TRIG_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX_CTIMER_TRIG */
#define INPUTMUX_CTIMER_TRIG_COUNT               (3U)


/*!
 * @}
 */ /* end of group INPUTMUX_Register_Masks */


/* INPUTMUX - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral INPUTMUX1 base address */
  #define INPUTMUX1_BASE                           (0x50046000u)
  /** Peripheral INPUTMUX1 base address */
  #define INPUTMUX1_BASE_NS                        (0x40046000u)
  /** Peripheral INPUTMUX1 base pointer */
  #define INPUTMUX1                                ((INPUTMUX_Type *)INPUTMUX1_BASE)
  /** Peripheral INPUTMUX1 base pointer */
  #define INPUTMUX1_NS                             ((INPUTMUX_Type *)INPUTMUX1_BASE_NS)
  /** Array initializer of INPUTMUX peripheral base addresses */
  #define INPUTMUX_BASE_ADDRS                      { INPUTMUX1_BASE }
  /** Array initializer of INPUTMUX peripheral base pointers */
  #define INPUTMUX_BASE_PTRS                       { INPUTMUX1 }
  /** Array initializer of INPUTMUX peripheral base addresses */
  #define INPUTMUX_BASE_ADDRS_NS                   { INPUTMUX1_BASE_NS }
  /** Array initializer of INPUTMUX peripheral base pointers */
  #define INPUTMUX_BASE_PTRS_NS                    { INPUTMUX1_NS }
#else
  /** Peripheral INPUTMUX1 base address */
  #define INPUTMUX1_BASE                           (0x40046000u)
  /** Peripheral INPUTMUX1 base pointer */
  #define INPUTMUX1                                ((INPUTMUX_Type *)INPUTMUX1_BASE)
  /** Array initializer of INPUTMUX peripheral base addresses */
  #define INPUTMUX_BASE_ADDRS                      { INPUTMUX1_BASE }
  /** Array initializer of INPUTMUX peripheral base pointers */
  #define INPUTMUX_BASE_PTRS                       { INPUTMUX1 }
#endif

/*!
 * @}
 */ /* end of group INPUTMUX_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- IOPCTL1 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOPCTL1_Peripheral_Access_Layer IOPCTL1 Peripheral Access Layer
 * @{
 */

/** IOPCTL1 - Register Layout Typedef */
typedef struct {
  __IO uint32_t PIO[3][32];                        /**< IOPCTL Configuration, array offset: 0x0, array step: index*0x80, index2*0x4, valid indices: [0][0-31], [1][0-2], [2][0-17] */
  __IO uint32_t PMIC_I2C_SDA;                      /**< PMIC_I2C_SDA, offset: 0x180 */
  __IO uint32_t PMIC_I2C_SCL;                      /**< PMIC_I2C_SCL, offset: 0x184 */
} IOPCTL1_Type;

/* ----------------------------------------------------------------------------
   -- IOPCTL1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOPCTL1_Register_Masks IOPCTL1 Register Masks
 * @{
 */

/*! @name PIO - IOPCTL Configuration */
/*! @{ */

