nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
/*! @name COM_STATUS - Common Status */
/*! @{ */

#define JPGDECWRP_COM_STATUS_CUR_SLOT_MASK       (0x60000000U)
#define JPGDECWRP_COM_STATUS_CUR_SLOT_SHIFT      (29U)
/*! CUR_SLOT - Current Slot */
#define JPGDECWRP_COM_STATUS_CUR_SLOT(x)         (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_COM_STATUS_CUR_SLOT_SHIFT)) & JPGDECWRP_COM_STATUS_CUR_SLOT_MASK)

#define JPGDECWRP_COM_STATUS_DEC_ONGOING_MASK    (0x80000000U)
#define JPGDECWRP_COM_STATUS_DEC_ONGOING_SHIFT   (31U)
/*! DEC_ONGOING - Decoding Ongoing */
#define JPGDECWRP_COM_STATUS_DEC_ONGOING(x)      (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_COM_STATUS_DEC_ONGOING_SHIFT)) & JPGDECWRP_COM_STATUS_DEC_ONGOING_MASK)
/*! @} */

/*! @name OUT_BUF_BASE0 - Output Image Frame Buffer0 Base Address */
/*! @{ */

#define JPGDECWRP_OUT_BUF_BASE0_OUT_BUF_BASE0_MASK (0xFFFFFFF0U)
#define JPGDECWRP_OUT_BUF_BASE0_OUT_BUF_BASE0_SHIFT (4U)
/*! OUT_BUF_BASE0 - Pixel Frame Buffer0 Base */
#define JPGDECWRP_OUT_BUF_BASE0_OUT_BUF_BASE0(x) (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_OUT_BUF_BASE0_OUT_BUF_BASE0_SHIFT)) & JPGDECWRP_OUT_BUF_BASE0_OUT_BUF_BASE0_MASK)
/*! @} */

/*! @name OUT_BUF_BASE1 - Output Image Frame Buffer1 Base Address */
/*! @{ */

#define JPGDECWRP_OUT_BUF_BASE1_OUT_BUF_BASE1_MASK (0xFFFFFFF0U)
#define JPGDECWRP_OUT_BUF_BASE1_OUT_BUF_BASE1_SHIFT (4U)
/*! OUT_BUF_BASE1 - Pixel Frame Buffer1 Base */
#define JPGDECWRP_OUT_BUF_BASE1_OUT_BUF_BASE1(x) (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_OUT_BUF_BASE1_OUT_BUF_BASE1_SHIFT)) & JPGDECWRP_OUT_BUF_BASE1_OUT_BUF_BASE1_MASK)
/*! @} */

/*! @name OUT_PITCH - Image Output Buffer Pitch */
/*! @{ */

#define JPGDECWRP_OUT_PITCH_OUT_PITCH_MASK       (0xFFFFU)
#define JPGDECWRP_OUT_PITCH_OUT_PITCH_SHIFT      (0U)
/*! OUT_PITCH - Output Image Pitch */
#define JPGDECWRP_OUT_PITCH_OUT_PITCH(x)         (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_OUT_PITCH_OUT_PITCH_SHIFT)) & JPGDECWRP_OUT_PITCH_OUT_PITCH_MASK)
/*! @} */

/*! @name STM_BUFBASE - Input JPEG Stream Buffer Base Address */
/*! @{ */

#define JPGDECWRP_STM_BUFBASE_STM_BUFBASE_MASK   (0xFFFFFFF0U)
#define JPGDECWRP_STM_BUFBASE_STM_BUFBASE_SHIFT  (4U)
/*! STM_BUFBASE - Bit Stream Buffer Base */
#define JPGDECWRP_STM_BUFBASE_STM_BUFBASE(x)     (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_STM_BUFBASE_STM_BUFBASE_SHIFT)) & JPGDECWRP_STM_BUFBASE_STM_BUFBASE_MASK)
/*! @} */

/*! @name STM_BUFSIZE - Input JPEG Stream Buffer Size */
/*! @{ */

#define JPGDECWRP_STM_BUFSIZE_STM_BUFSIZE_MASK   (0xFFFFFC00U)
#define JPGDECWRP_STM_BUFSIZE_STM_BUFSIZE_SHIFT  (10U)
/*! STM_BUFSIZE - Bit Stream Buffer Size */
#define JPGDECWRP_STM_BUFSIZE_STM_BUFSIZE(x)     (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_STM_BUFSIZE_STM_BUFSIZE_SHIFT)) & JPGDECWRP_STM_BUFSIZE_STM_BUFSIZE_MASK)
/*! @} */

/*! @name IMGSIZE - Image Resolution */
/*! @{ */

#define JPGDECWRP_IMGSIZE_IMG_HEIGHT_MASK        (0x3FFFU)
#define JPGDECWRP_IMGSIZE_IMG_HEIGHT_SHIFT       (0U)
/*! IMG_HEIGHT - Image Height */
#define JPGDECWRP_IMGSIZE_IMG_HEIGHT(x)          (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_IMGSIZE_IMG_HEIGHT_SHIFT)) & JPGDECWRP_IMGSIZE_IMG_HEIGHT_MASK)

#define JPGDECWRP_IMGSIZE_IMG_WIDTH_MASK         (0x3FFF0000U)
#define JPGDECWRP_IMGSIZE_IMG_WIDTH_SHIFT        (16U)
/*! IMG_WIDTH - Image Width */
#define JPGDECWRP_IMGSIZE_IMG_WIDTH(x)           (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_IMGSIZE_IMG_WIDTH_SHIFT)) & JPGDECWRP_IMGSIZE_IMG_WIDTH_MASK)
/*! @} */

/*! @name STM_CTRL - Bit Stream and Switching Control */
/*! @{ */

#define JPGDECWRP_STM_CTRL_PIXEL_PRECISION_MASK  (0x4U)
#define JPGDECWRP_STM_CTRL_PIXEL_PRECISION_SHIFT (2U)
/*! PIXEL_PRECISION - Pixel Precision
 *  0b0..8-bit
 *  0b1..12-bit
 */
#define JPGDECWRP_STM_CTRL_PIXEL_PRECISION(x)    (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_STM_CTRL_PIXEL_PRECISION_SHIFT)) & JPGDECWRP_STM_CTRL_PIXEL_PRECISION_MASK)

#define JPGDECWRP_STM_CTRL_IMAGE_FORMAT_MASK     (0x78U)
#define JPGDECWRP_STM_CTRL_IMAGE_FORMAT_SHIFT    (3U)
/*! IMAGE_FORMAT - Image Format
 *  0b0000..YUV420 (2-planar, Y at the first planar, and UV at the second planar)
 *  0b0001..YUV422 (1-planar in the YUYV sequence)
 *  0b0010..RGB (BGRBGR packed format)
 *  0b0011..YUV444 (first planar in the YUVYUV sequence)
 *  0b0100..Gray (Y8 or Y12) or single component
 *  0b0101..
 *  0b0110..ARGB
 */
#define JPGDECWRP_STM_CTRL_IMAGE_FORMAT(x)       (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_STM_CTRL_IMAGE_FORMAT_SHIFT)) & JPGDECWRP_STM_CTRL_IMAGE_FORMAT_MASK)

#define JPGDECWRP_STM_CTRL_BITBUF_PTR_CLR_MASK   (0x80U)
#define JPGDECWRP_STM_CTRL_BITBUF_PTR_CLR_SHIFT  (7U)
/*! BITBUF_PTR_CLR - Bit Buffer Pointer Clear
 *  0b0..Restores the bit stream buffer pointer from the save pointer.
 *  0b1..Clears the bit stream buffer pointer from the save pointer.
 */
#define JPGDECWRP_STM_CTRL_BITBUF_PTR_CLR(x)     (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_STM_CTRL_BITBUF_PTR_CLR_SHIFT)) & JPGDECWRP_STM_CTRL_BITBUF_PTR_CLR_MASK)

#define JPGDECWRP_STM_CTRL_AUTO_START_MASK       (0x100U)
#define JPGDECWRP_STM_CTRL_AUTO_START_SHIFT      (8U)
/*! AUTO_START - Auto Start
 *  0b0..Do not write 1 to CTRL[GO] in JPEGDEC.
 *  0b1..Writes 1 to CTRL[GO] in JPEGDEC.
 */
#define JPGDECWRP_STM_CTRL_AUTO_START(x)         (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_STM_CTRL_AUTO_START_SHIFT)) & JPGDECWRP_STM_CTRL_AUTO_START_MASK)
/*! @} */

/*! @name SLOT_STATUS - Bit Stream Status */
/*! @{ */

#define JPGDECWRP_SLOT_STATUS_STMBUF_HALF_MASK   (0x1U)
#define JPGDECWRP_SLOT_STATUS_STMBUF_HALF_SHIFT  (0U)
/*! STMBUF_HALF - Stream Buffer Half Flag
 *  0b0..The bit stream buffer pointer for the current slot has not passed half of the buffer size.
 *  0b1..The bit stream buffer pointer for the current slot passed half of the buffer size.
 *  0b0..No effect
 *  0b1..Clears the flag.
 */
#define JPGDECWRP_SLOT_STATUS_STMBUF_HALF(x)     (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_SLOT_STATUS_STMBUF_HALF_SHIFT)) & JPGDECWRP_SLOT_STATUS_STMBUF_HALF_MASK)

#define JPGDECWRP_SLOT_STATUS_STMBUF_RTND_MASK   (0x2U)
#define JPGDECWRP_SLOT_STATUS_STMBUF_RTND_SHIFT  (1U)
/*! STMBUF_RTND - Stream Buffer Returned Flag
 *  0b0..The bit stream buffer pointer for the current slot has not passed the top mark of the buffer.
 *  0b1..The bit stream buffer pointer for the current slot passed the top mark of the buffer.
 *  0b0..No effect
 *  0b1..Clears the flag.
 */
#define JPGDECWRP_SLOT_STATUS_STMBUF_RTND(x)     (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_SLOT_STATUS_STMBUF_RTND_SHIFT)) & JPGDECWRP_SLOT_STATUS_STMBUF_RTND_MASK)

#define JPGDECWRP_SLOT_STATUS_SWITCHED_IN_MASK   (0x4U)
#define JPGDECWRP_SLOT_STATUS_SWITCHED_IN_SHIFT  (2U)
/*! SWITCHED_IN - Switched In Flag
 *  0b0..The current slot is not switched in during context switching.
 *  0b1..The current slot is switched in during context switching.
 *  0b0..No effect
 *  0b1..Clears the flag.
 */
#define JPGDECWRP_SLOT_STATUS_SWITCHED_IN(x)     (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_SLOT_STATUS_SWITCHED_IN_SHIFT)) & JPGDECWRP_SLOT_STATUS_SWITCHED_IN_MASK)

#define JPGDECWRP_SLOT_STATUS_FRMDONE_MASK       (0x8U)
#define JPGDECWRP_SLOT_STATUS_FRMDONE_SHIFT      (3U)
/*! FRMDONE - Frame Done Flag
 *  0b0..Decoding is not completed.
 *  0b1..Decoding is completed.
 *  0b0..No effect
 *  0b1..Clears the flag.
 */
#define JPGDECWRP_SLOT_STATUS_FRMDONE(x)         (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_SLOT_STATUS_FRMDONE_SHIFT)) & JPGDECWRP_SLOT_STATUS_FRMDONE_MASK)

#define JPGDECWRP_SLOT_STATUS_DECERR_MASK        (0x100U)
#define JPGDECWRP_SLOT_STATUS_DECERR_SHIFT       (8U)
/*! DECERR - Decoding Error Flag
 *  0b0..No decoding error occurred.
 *  0b1..A decoding error occurred.
 *  0b0..No effect
 *  0b1..Clears the flag.
 */
#define JPGDECWRP_SLOT_STATUS_DECERR(x)          (((uint32_t)(((uint32_t)(x)) << JPGDECWRP_SLOT_STATUS_DECERR_SHIFT)) & JPGDECWRP_SLOT_STATUS_DECERR_MASK)

