nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
/* The count of NIC_MAX_OT */
#define NIC_MAX_OT_COUNT                         (10U)

/*! @name MAX_COMB_OT - Maximum Combined Outstanding Transactions */
/*! @{ */

#define NIC_MAX_COMB_OT_AWAR_MAX_OTF_MASK        (0xFFU)
#define NIC_MAX_COMB_OT_AWAR_MAX_OTF_SHIFT       (0U)
/*! AWAR_MAX_OTF - Fractional Part of Maximum Combined Outstanding AW and AR Addresses */
#define NIC_MAX_COMB_OT_AWAR_MAX_OTF(x)          (((uint32_t)(((uint32_t)(x)) << NIC_MAX_COMB_OT_AWAR_MAX_OTF_SHIFT)) & NIC_MAX_COMB_OT_AWAR_MAX_OTF_MASK)

#define NIC_MAX_COMB_OT_AWAR_MAX_OTI_MASK        (0x7F00U)
#define NIC_MAX_COMB_OT_AWAR_MAX_OTI_SHIFT       (8U)
/*! AWAR_MAX_OTI - Integer Part of Maximum Combined Outstanding AW and AR Addresses */
#define NIC_MAX_COMB_OT_AWAR_MAX_OTI(x)          (((uint32_t)(((uint32_t)(x)) << NIC_MAX_COMB_OT_AWAR_MAX_OTI_SHIFT)) & NIC_MAX_COMB_OT_AWAR_MAX_OTI_MASK)
/*! @} */

/* The count of NIC_MAX_COMB_OT */
#define NIC_MAX_COMB_OT_COUNT                    (10U)

/*! @name AW_P - AW Channel Peak Rate */
/*! @{ */

#define NIC_AW_P_AW_P_MASK                       (0xFF000000U)
#define NIC_AW_P_AW_P_SHIFT                      (24U)
/*! AW_P - AW Channel Peak Rate */
#define NIC_AW_P_AW_P(x)                         (((uint32_t)(((uint32_t)(x)) << NIC_AW_P_AW_P_SHIFT)) & NIC_AW_P_AW_P_MASK)
/*! @} */

/* The count of NIC_AW_P */
#define NIC_AW_P_COUNT                           (10U)

/*! @name AW_B - AW Channel Burstiness Allowance */
/*! @{ */

#define NIC_AW_B_AW_B_MASK                       (0xFFFFU)
#define NIC_AW_B_AW_B_SHIFT                      (0U)
/*! AW_B - AW Channel Burstiness */
#define NIC_AW_B_AW_B(x)                         (((uint32_t)(((uint32_t)(x)) << NIC_AW_B_AW_B_SHIFT)) & NIC_AW_B_AW_B_MASK)
/*! @} */

/* The count of NIC_AW_B */
#define NIC_AW_B_COUNT                           (10U)

/*! @name AW_R - AW Channel Average Rate */
/*! @{ */

#define NIC_AW_R_AW_R_MASK                       (0xFFF00000U)
#define NIC_AW_R_AW_R_SHIFT                      (20U)
/*! AW_R - AW Channel Average Rate */
#define NIC_AW_R_AW_R(x)                         (((uint32_t)(((uint32_t)(x)) << NIC_AW_R_AW_R_SHIFT)) & NIC_AW_R_AW_R_MASK)
/*! @} */

/* The count of NIC_AW_R */
#define NIC_AW_R_COUNT                           (10U)

/*! @name AR_P - AR Channel Peak Rate */
/*! @{ */

#define NIC_AR_P_AR_P_MASK                       (0xFF000000U)
#define NIC_AR_P_AR_P_SHIFT                      (24U)
/*! AR_P - AR Channel Peak Rate */
#define NIC_AR_P_AR_P(x)                         (((uint32_t)(((uint32_t)(x)) << NIC_AR_P_AR_P_SHIFT)) & NIC_AR_P_AR_P_MASK)
/*! @} */

/* The count of NIC_AR_P */
#define NIC_AR_P_COUNT                           (10U)

/*! @name AR_B - AR Channel Burstiness Allowance */
/*! @{ */

#define NIC_AR_B_AR_B_MASK                       (0xFFFFU)
#define NIC_AR_B_AR_B_SHIFT                      (0U)
/*! AR_B - AR Channel Burstiness */
#define NIC_AR_B_AR_B(x)                         (((uint32_t)(((uint32_t)(x)) << NIC_AR_B_AR_B_SHIFT)) & NIC_AR_B_AR_B_MASK)
/*! @} */

/* The count of NIC_AR_B */
#define NIC_AR_B_COUNT                           (10U)

/*! @name AR_R - AR Channel Average Rate */
/*! @{ */

#define NIC_AR_R_AR_R_MASK                       (0xFFF00000U)
#define NIC_AR_R_AR_R_SHIFT                      (20U)
/*! AR_R - AR Channel Average Rate */
#define NIC_AR_R_AR_R(x)                         (((uint32_t)(((uint32_t)(x)) << NIC_AR_R_AR_R_SHIFT)) & NIC_AR_R_AR_R_MASK)
/*! @} */

/* The count of NIC_AR_R */
#define NIC_AR_R_COUNT                           (10U)

/*! @name TARGET_FC - Feedback Controlled Target */
/*! @{ */

#define NIC_TARGET_FC_AW_TGT_LATENCY_MASK        (0xFFFU)
#define NIC_TARGET_FC_AW_TGT_LATENCY_SHIFT       (0U)
/*! AW_TGT_LATENCY - AW Channel Target Latency */
#define NIC_TARGET_FC_AW_TGT_LATENCY(x)          (((uint32_t)(((uint32_t)(x)) << NIC_TARGET_FC_AW_TGT_LATENCY_SHIFT)) & NIC_TARGET_FC_AW_TGT_LATENCY_MASK)

#define NIC_TARGET_FC_AR_TGT_LATENCY_MASK        (0xFFF0000U)
#define NIC_TARGET_FC_AR_TGT_LATENCY_SHIFT       (16U)
/*! AR_TGT_LATENCY - AR Channel Target Latency */
#define NIC_TARGET_FC_AR_TGT_LATENCY(x)          (((uint32_t)(((uint32_t)(x)) << NIC_TARGET_FC_AR_TGT_LATENCY_SHIFT)) & NIC_TARGET_FC_AR_TGT_LATENCY_MASK)
/*! @} */

/* The count of NIC_TARGET_FC */
#define NIC_TARGET_FC_COUNT                      (10U)

/*! @name KI_FC - Feedback Controlled Scale */
/*! @{ */

#define NIC_KI_FC_AW_KI_MASK                     (0x7U)
#define NIC_KI_FC_AW_KI_SHIFT                    (0U)
/*! AW_KI - awqos Scale Factor
 *  0b000..2^-3
 *  0b001..2^-4
 *  0b010-0b110..2^-5 to 2^-9
 *  0b111..2^-10
 */
#define NIC_KI_FC_AW_KI(x)                       (((uint32_t)(((uint32_t)(x)) << NIC_KI_FC_AW_KI_SHIFT)) & NIC_KI_FC_AW_KI_MASK)

#define NIC_KI_FC_AR_KI_MASK                     (0x700U)
#define NIC_KI_FC_AR_KI_SHIFT                    (8U)
/*! AR_KI - arqos Scale Factor
 *  0b000..2^-3
 *  0b001..2^-4
 *  0b010-0b110..2^-5 to 2^-9
 *  0b111..2^-10
 */
#define NIC_KI_FC_AR_KI(x)                       (((uint32_t)(((uint32_t)(x)) << NIC_KI_FC_AR_KI_SHIFT)) & NIC_KI_FC_AR_KI_MASK)
/*! @} */

/* The count of NIC_KI_FC */
#define NIC_KI_FC_COUNT                          (10U)

/*! @name QOS_RANGE - QoS Range */
/*! @{ */

#define NIC_QOS_RANGE_AW_MIN_QOS_MASK            (0xFU)
#define NIC_QOS_RANGE_AW_MIN_QOS_SHIFT           (0U)
/*! AW_MIN_QOS - Minimum awqos
 *  0b0000..The lowest priority
 *  0b0001-0b1110.....
 *  0b1111..The highest priority
 */
#define NIC_QOS_RANGE_AW_MIN_QOS(x)              (((uint32_t)(((uint32_t)(x)) << NIC_QOS_RANGE_AW_MIN_QOS_SHIFT)) & NIC_QOS_RANGE_AW_MIN_QOS_MASK)

#define NIC_QOS_RANGE_AW_MAX_QOS_MASK            (0xF00U)
#define NIC_QOS_RANGE_AW_MAX_QOS_SHIFT           (8U)
/*! AW_MAX_QOS - Maximum awqos
 *  0b0000..The lowest priority
 *  0b0001-0b1110.....
 *  0b1111..The highest priority
 */
#define NIC_QOS_RANGE_AW_MAX_QOS(x)              (((uint32_t)(((uint32_t)(x)) << NIC_QOS_RANGE_AW_MAX_QOS_SHIFT)) & NIC_QOS_RANGE_AW_MAX_QOS_MASK)

#define NIC_QOS_RANGE_AR_MIN_QOS_MASK            (0xF0000U)
#define NIC_QOS_RANGE_AR_MIN_QOS_SHIFT           (16U)
/*! AR_MIN_QOS - Minimum arqos
 *  0b0000..The lowest priority
 *  0b0001-0b1110.....
 *  0b1111..The highest priority
 */
#define NIC_QOS_RANGE_AR_MIN_QOS(x)              (((uint32_t)(((uint32_t)(x)) << NIC_QOS_RANGE_AR_MIN_QOS_SHIFT)) & NIC_QOS_RANGE_AR_MIN_QOS_MASK)

#define NIC_QOS_RANGE_AR_MAX_QOS_MASK            (0xF000000U)
#define NIC_QOS_RANGE_AR_MAX_QOS_SHIFT           (24U)
/*! AR_MAX_QOS - Maximum arqos
 *  0b0000..The lowest priority
 *  0b0001-0b1110.....
 *  0b1111..The highest priority
 */
#define NIC_QOS_RANGE_AR_MAX_QOS(x)              (((uint32_t)(((uint32_t)(x)) << NIC_QOS_RANGE_AR_MAX_QOS_SHIFT)) & NIC_QOS_RANGE_AR_MAX_QOS_MASK)
/*! @} */

/* The count of NIC_QOS_RANGE */
#define NIC_QOS_RANGE_COUNT                      (10U)


/*!
 * @}
 */ /* end of group NIC_Register_Masks */


/* NIC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral NIC_MEDIA1 base address */
  #define NIC_MEDIA1_BASE                          (0x504C0000u)
  /** Peripheral NIC_MEDIA1 base address */
  #define NIC_MEDIA1_BASE_NS                       (0x404C0000u)
  /** Peripheral NIC_MEDIA1 base pointer */
  #define NIC_MEDIA1                               ((NIC_Type *)NIC_MEDIA1_BASE)
  /** Peripheral NIC_MEDIA1 base pointer */
  #define NIC_MEDIA1_NS                            ((NIC_Type *)NIC_MEDIA1_BASE_NS)
  /** Array initializer of NIC peripheral base addresses */
  #define NIC_BASE_ADDRS                           { NIC_MEDIA1_BASE }
  /** Array initializer of NIC peripheral base pointers */
  #define NIC_BASE_PTRS                            { NIC_MEDIA1 }
  /** Array initializer of NIC peripheral base addresses */
  #define NIC_BASE_ADDRS_NS                        { NIC_MEDIA1_BASE_NS }
  /** Array initializer of NIC peripheral base pointers */
  #define NIC_BASE_PTRS_NS                         { NIC_MEDIA1_NS }
#else
  /** Peripheral NIC_MEDIA1 base address */
  #define NIC_MEDIA1_BASE                          (0x404C0000u)
  /** Peripheral NIC_MEDIA1 base pointer */
  #define NIC_MEDIA1                               ((NIC_Type *)NIC_MEDIA1_BASE)
  /** Array initializer of NIC peripheral base addresses */
  #define NIC_BASE_ADDRS                           { NIC_MEDIA1_BASE }
  /** Array initializer of NIC peripheral base pointers */
  #define NIC_BASE_PTRS                            { NIC_MEDIA1 }
#endif

/*!
 * @}
 */ /* end of group NIC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- OSC32KNP Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSC32KNP_Peripheral_Access_Layer OSC32KNP Peripheral Access Layer
 * @{
 */

/** OSC32KNP - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL;                              /**< Control, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __IO uint32_t STAT;                              /**< Clock Status, offset: 0x8 */
} OSC32KNP_Type;

/* ----------------------------------------------------------------------------
   -- OSC32KNP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup OSC32KNP_Register_Masks OSC32KNP Register Masks
 * @{
 */

/*! @name CTRL - Control */
/*! @{ */

#define OSC32KNP_CTRL_OSC_DIS_MASK               (0x1U)
#define OSC32KNP_CTRL_OSC_DIS_SHIFT              (0U)
/*! OSC_DIS - Oscillator Output Disable
 *  0b0..Enable the oscillator output
 *  0b1..Disable the oscillator output
 */
#define OSC32KNP_CTRL_OSC_DIS(x)                 (((uint32_t)(((uint32_t)(x)) << OSC32KNP_CTRL_OSC_DIS_SHIFT)) & OSC32KNP_CTRL_OSC_DIS_MASK)

#define OSC32KNP_CTRL_MODE_MASK                  (0x2U)
#define OSC32KNP_CTRL_MODE_SHIFT                 (1U)
/*! MODE - Mode
 *  0b0..Low-Power (Nano-Power) mode
 *  0b1..High-Power mode
 */
#define OSC32KNP_CTRL_MODE(x)                    (((uint32_t)(((uint32_t)(x)) << OSC32KNP_CTRL_MODE_SHIFT)) & OSC32KNP_CTRL_MODE_MASK)

#define OSC32KNP_CTRL_BYPASS_EN_MASK             (0x4U)
#define OSC32KNP_CTRL_BYPASS_EN_SHIFT            (2U)
/*! BYPASS_EN - Bypass Mode Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define OSC32KNP_CTRL_BYPASS_EN(x)               (((uint32_t)(((uint32_t)(x)) << OSC32KNP_CTRL_BYPASS_EN_SHIFT)) & OSC32KNP_CTRL_BYPASS_EN_MASK)

#define OSC32KNP_CTRL_CAP_TRIM_MASK              (0xF00U)
#define OSC32KNP_CTRL_CAP_TRIM_SHIFT             (8U)
/*! CAP_TRIM - Capacitor Trim Value
 *  0b0000..0 pF
 *  0b0001..2 pF
 *  0b0010..4 pF
 *  0b0011..6 pF
 *  0b0100..8 pF
 *  0b0101..10 pF
 *  0b0110..12 pF
 *  0b0111..14 pF
 *  0b1000..16 pF
 *  0b1001..18 pF
 *  0b1010..20 pF
 *  0b1011..22 pF
 *  0b1100..24 pF
 *  0b1101..26 pF
 *  0b1110..28 pF
 *  0b1111..30 pF
 */
#define OSC32KNP_CTRL_CAP_TRIM(x)                (((uint32_t)(((uint32_t)(x)) << OSC32KNP_CTRL_CAP_TRIM_SHIFT)) & OSC32KNP_CTRL_CAP_TRIM_MASK)

