nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
#define PMC_FLAGS_DSCOMPF_MASK                   (0x40000000U)
#define PMC_FLAGS_DSCOMPF_SHIFT                  (30U)
/*! DSCOMPF - CPU0 Deep Sleep Flag
 *  0b0..CPU0 Deep Sleep cleared
 *  0b1..CPU0 Deep Sleep asserted
 */
#define PMC_FLAGS_DSCOMPF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_DSCOMPF_SHIFT)) & PMC_FLAGS_DSCOMPF_MASK)

#define PMC_FLAGS_DEEPPDF_MASK                   (0x80000000U)
#define PMC_FLAGS_DEEPPDF_SHIFT                  (31U)
/*! DEEPPDF - DPD Wake-up Flag
 *  0b0..DPD wake-up cleared
 *  0b1..DPD wake-up asserted
 */
#define PMC_FLAGS_DEEPPDF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_DEEPPDF_SHIFT)) & PMC_FLAGS_DEEPPDF_MASK)
/*! @} */

/*! @name CTRL - Control */
/*! @{ */

#define PMC_CTRL_APPLYCFG_MASK                   (0x1U)
#define PMC_CTRL_APPLYCFG_SHIFT                  (0U)
/*! APPLYCFG - Apply Configure for PMC1
 *  0b1..Start configuration change, or operation has not completed
 *  0b0..Operation is done
 */
#define PMC_CTRL_APPLYCFG(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_APPLYCFG_SHIFT)) & PMC_CTRL_APPLYCFG_MASK)

#define PMC_CTRL_AGDET1RE_MASK                   (0x10000U)
#define PMC_CTRL_AGDET1RE_SHIFT                  (16U)
/*! AGDET1RE - VDD1 Glitch Detector Reset Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define PMC_CTRL_AGDET1RE(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_AGDET1RE_SHIFT)) & PMC_CTRL_AGDET1RE_MASK)

#define PMC_CTRL_AGDET2RE_MASK                   (0x20000U)
#define PMC_CTRL_AGDET2RE_SHIFT                  (17U)
/*! AGDET2RE - VDD2 Glitch Detector Reset Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define PMC_CTRL_AGDET2RE(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_AGDET2RE_SHIFT)) & PMC_CTRL_AGDET2RE_MASK)

#define PMC_CTRL_LVD1RE_MASK                     (0x40000U)
#define PMC_CTRL_LVD1RE_SHIFT                    (18U)
/*! LVD1RE - VDD1 Low-Voltage Detector Reset Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define PMC_CTRL_LVD1RE(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_LVD1RE_SHIFT)) & PMC_CTRL_LVD1RE_MASK)

#define PMC_CTRL_LVD2RE_MASK                     (0x80000U)
#define PMC_CTRL_LVD2RE_SHIFT                    (19U)
/*! LVD2RE - VDD2 Low-Voltage Detector Reset Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define PMC_CTRL_LVD2RE(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_LVD2RE_SHIFT)) & PMC_CTRL_LVD2RE_MASK)

#define PMC_CTRL_LVDNRE_MASK                     (0x100000U)
#define PMC_CTRL_LVDNRE_SHIFT                    (20U)
/*! LVDNRE - VDDN Low-Voltage Detector Reset Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define PMC_CTRL_LVDNRE(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_LVDNRE_SHIFT)) & PMC_CTRL_LVDNRE_MASK)

#define PMC_CTRL_HVDV1RE_MASK                    (0x200000U)
#define PMC_CTRL_HVDV1RE_SHIFT                   (21U)
/*! HVDV1RE - VDD1 High-Voltage Detector Reset Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define PMC_CTRL_HVDV1RE(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_HVDV1RE_SHIFT)) & PMC_CTRL_HVDV1RE_MASK)

#define PMC_CTRL_HVDV2RE_MASK                    (0x400000U)
#define PMC_CTRL_HVDV2RE_SHIFT                   (22U)
/*! HVDV2RE - VDD2 High-Voltage Detector Reset Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define PMC_CTRL_HVDV2RE(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_HVDV2RE_SHIFT)) & PMC_CTRL_HVDV2RE_MASK)

#define PMC_CTRL_HVDVNRE_MASK                    (0x800000U)
#define PMC_CTRL_HVDVNRE_SHIFT                   (23U)
/*! HVDVNRE - VDDN High-Voltage Detector Reset Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define PMC_CTRL_HVDVNRE(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_HVDVNRE_SHIFT)) & PMC_CTRL_HVDVNRE_MASK)

#define PMC_CTRL_HVD1V8RE_MASK                   (0x1000000U)
#define PMC_CTRL_HVD1V8RE_SHIFT                  (24U)
/*! HVD1V8RE - VDD1V8 High-Voltage Detector Reset Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define PMC_CTRL_HVD1V8RE(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_HVD1V8RE_SHIFT)) & PMC_CTRL_HVD1V8RE_MASK)
/*! @} */

/*! @name INTRCTRL - Interrupt Control in Sense Domain */
/*! @{ */

#define PMC_INTRCTRL_BBSR1EIE_MASK               (0x4U)
#define PMC_INTRCTRL_BBSR1EIE_SHIFT              (2U)
/*! BBSR1EIE - VDD1 SRAM Body Bias Error Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_BBSR1EIE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_BBSR1EIE_SHIFT)) & PMC_INTRCTRL_BBSR1EIE_MASK)

#define PMC_INTRCTRL_BBSR2EIE_MASK               (0x8U)
#define PMC_INTRCTRL_BBSR2EIE_SHIFT              (3U)
/*! BBSR2EIE - VDD2 SRAM Body Bias Error Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_BBSR2EIE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_BBSR2EIE_SHIFT)) & PMC_INTRCTRL_BBSR2EIE_MASK)

#define PMC_INTRCTRL_BB1EIE_MASK                 (0x10U)
#define PMC_INTRCTRL_BB1EIE_SHIFT                (4U)
/*! BB1EIE - VDD1 Body Bias Error Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_BB1EIE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_BB1EIE_SHIFT)) & PMC_INTRCTRL_BB1EIE_MASK)

#define PMC_INTRCTRL_BB2EIE_MASK                 (0x20U)
#define PMC_INTRCTRL_BB2EIE_SHIFT                (5U)
/*! BB2EIE - VDD2 Body Bias Error Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_BB2EIE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_BB2EIE_SHIFT)) & PMC_INTRCTRL_BB2EIE_MASK)

#define PMC_INTRCTRL_BBNEIE_MASK                 (0x40U)
#define PMC_INTRCTRL_BBNEIE_SHIFT                (6U)
/*! BBNEIE - VDDN Body Bias Error Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_BBNEIE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_BBNEIE_SHIFT)) & PMC_INTRCTRL_BBNEIE_MASK)

#define PMC_INTRCTRL_SCP1OCIE_MASK               (0x80U)
#define PMC_INTRCTRL_SCP1OCIE_SHIFT              (7U)
/*! SCP1OCIE - SCPC VDD1 Overcurrent Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define PMC_INTRCTRL_SCP1OCIE(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_INTRCTRL_SCP1OCIE_SHIFT)) & PMC_INTRCTRL_SCP1OCIE_MASK)

