nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
#define PMC_PDSLEEPCFG4_EZH_TCM_MASK             (0x10000U)
#define PMC_PDSLEEPCFG4_EZH_TCM_SHIFT            (16U)
/*! EZH_TCM - EZH-V TCM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_EZH_TCM(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_EZH_TCM_SHIFT)) & PMC_PDSLEEPCFG4_EZH_TCM_MASK)

#define PMC_PDSLEEPCFG4_NPU_MASK                 (0x20000U)
#define PMC_PDSLEEPCFG4_NPU_SHIFT                (17U)
/*! NPU - NPU
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_NPU(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_NPU_SHIFT)) & PMC_PDSLEEPCFG4_NPU_MASK)

#define PMC_PDSLEEPCFG4_XSPI0_MASK               (0x40000U)
#define PMC_PDSLEEPCFG4_XSPI0_SHIFT              (18U)
/*! XSPI0 - XSPI0, MMU0, and Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_XSPI0(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_XSPI0_SHIFT)) & PMC_PDSLEEPCFG4_XSPI0_MASK)

#define PMC_PDSLEEPCFG4_XSPI1_MASK               (0x80000U)
#define PMC_PDSLEEPCFG4_XSPI1_SHIFT              (19U)
/*! XSPI1 - XSPI1, MMU1, and Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_XSPI1(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_XSPI1_SHIFT)) & PMC_PDSLEEPCFG4_XSPI1_MASK)

#define PMC_PDSLEEPCFG4_XSPI2_MASK               (0x100000U)
#define PMC_PDSLEEPCFG4_XSPI2_SHIFT              (20U)
/*! XSPI2 - XSPI2 and MMU2
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG4_XSPI2(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_XSPI2_SHIFT)) & PMC_PDSLEEPCFG4_XSPI2_MASK)

#define PMC_PDSLEEPCFG4_LCD_MASK                 (0x200000U)
#define PMC_PDSLEEPCFG4_LCD_SHIFT                (21U)
/*! LCD - LCDIF
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG4_LCD(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_LCD_SHIFT)) & PMC_PDSLEEPCFG4_LCD_MASK)

#define PMC_PDSLEEPCFG4_OCOTP_MASK               (0x400000U)
#define PMC_PDSLEEPCFG4_OCOTP_SHIFT              (22U)
/*! OCOTP - OCOTP Shadow SRAM
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDSLEEPCFG4_OCOTP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG4_OCOTP_SHIFT)) & PMC_PDSLEEPCFG4_OCOTP_MASK)
/*! @} */

/*! @name PDSLEEPCFG5 - PD Sleep Configuration 5 in Sense Domain */
/*! @{ */

#define PMC_PDSLEEPCFG5_SDHC0_SRAM_MASK          (0x1U)
#define PMC_PDSLEEPCFG5_SDHC0_SRAM_SHIFT         (0U)
/*! SDHC0_SRAM - uSDHC0 SRAM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_SDHC0_SRAM(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_SDHC0_SRAM_SHIFT)) & PMC_PDSLEEPCFG5_SDHC0_SRAM_MASK)

#define PMC_PDSLEEPCFG5_SDHC1_SRAM_MASK          (0x2U)
#define PMC_PDSLEEPCFG5_SDHC1_SRAM_SHIFT         (1U)
/*! SDHC1_SRAM - uSDHC1 SRAM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_SDHC1_SRAM(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_SDHC1_SRAM_SHIFT)) & PMC_PDSLEEPCFG5_SDHC1_SRAM_MASK)

#define PMC_PDSLEEPCFG5_USB0_SRAM_MASK           (0x4U)
#define PMC_PDSLEEPCFG5_USB0_SRAM_SHIFT          (2U)
/*! USB0_SRAM - USB0 SRAM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_USB0_SRAM(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_USB0_SRAM_SHIFT)) & PMC_PDSLEEPCFG5_USB0_SRAM_MASK)

#define PMC_PDSLEEPCFG5_USB1_SRAM_MASK           (0x8U)
#define PMC_PDSLEEPCFG5_USB1_SRAM_SHIFT          (3U)
/*! USB1_SRAM - USB1 SRAM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_USB1_SRAM(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_USB1_SRAM_SHIFT)) & PMC_PDSLEEPCFG5_USB1_SRAM_MASK)

#define PMC_PDSLEEPCFG5_JPEG_MASK                (0x10U)
#define PMC_PDSLEEPCFG5_JPEG_SHIFT               (4U)
/*! JPEG - JPEGDEC
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_JPEG(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_JPEG_SHIFT)) & PMC_PDSLEEPCFG5_JPEG_MASK)

#define PMC_PDSLEEPCFG5_PNG_MASK                 (0x20U)
#define PMC_PDSLEEPCFG5_PNG_SHIFT                (5U)
/*! PNG - PNGDEC
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_PNG(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_PNG_SHIFT)) & PMC_PDSLEEPCFG5_PNG_MASK)

#define PMC_PDSLEEPCFG5_MIPI_MASK                (0x40U)
#define PMC_PDSLEEPCFG5_MIPI_SHIFT               (6U)
/*! MIPI - MIPI
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_MIPI(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_MIPI_SHIFT)) & PMC_PDSLEEPCFG5_MIPI_MASK)

#define PMC_PDSLEEPCFG5_GPU_MASK                 (0x80U)
#define PMC_PDSLEEPCFG5_GPU_SHIFT                (7U)
/*! GPU - VGPU
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_GPU(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_GPU_SHIFT)) & PMC_PDSLEEPCFG5_GPU_MASK)

#define PMC_PDSLEEPCFG5_DMA2_3_MASK              (0x100U)
#define PMC_PDSLEEPCFG5_DMA2_3_SHIFT             (8U)
/*! DMA2_3 - DMA2 and DMA3
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_DMA2_3(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_DMA2_3_SHIFT)) & PMC_PDSLEEPCFG5_DMA2_3_MASK)

#define PMC_PDSLEEPCFG5_DMA0_1_P_E_MASK          (0x200U)
#define PMC_PDSLEEPCFG5_DMA0_1_P_E_SHIFT         (9U)
/*! DMA0_1_P_E - DMA0-1, PKC, and ETF
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_DMA0_1_P_E(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_DMA0_1_P_E_SHIFT)) & PMC_PDSLEEPCFG5_DMA0_1_P_E_MASK)

#define PMC_PDSLEEPCFG5_CPU0_CCACHE_MASK         (0x400U)
#define PMC_PDSLEEPCFG5_CPU0_CCACHE_SHIFT        (10U)
/*! CPU0_CCACHE - CPU0 Code Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_CPU0_CCACHE(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_CPU0_CCACHE_SHIFT)) & PMC_PDSLEEPCFG5_CPU0_CCACHE_MASK)

#define PMC_PDSLEEPCFG5_CPU0_SCACHE_MASK         (0x800U)
#define PMC_PDSLEEPCFG5_CPU0_SCACHE_SHIFT        (11U)
/*! CPU0_SCACHE - CPU0 System Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_CPU0_SCACHE(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_CPU0_SCACHE_SHIFT)) & PMC_PDSLEEPCFG5_CPU0_SCACHE_MASK)

#define PMC_PDSLEEPCFG5_DSP_ICACHE_MASK          (0x1000U)
#define PMC_PDSLEEPCFG5_DSP_ICACHE_SHIFT         (12U)
/*! DSP_ICACHE - HiFi4 Instruction Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_DSP_ICACHE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_DSP_ICACHE_SHIFT)) & PMC_PDSLEEPCFG5_DSP_ICACHE_MASK)

#define PMC_PDSLEEPCFG5_DSP_DCACHE_MASK          (0x2000U)
#define PMC_PDSLEEPCFG5_DSP_DCACHE_SHIFT         (13U)
/*! DSP_DCACHE - HiFi4 Data Cache
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG5_DSP_DCACHE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG5_DSP_DCACHE_SHIFT)) & PMC_PDSLEEPCFG5_DSP_DCACHE_MASK)

