nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
#define PMC_PDCFGSTATUS1_HVD1_PD_MASK            (0x20U)
#define PMC_PDCFGSTATUS1_HVD1_PD_SHIFT           (5U)
/*! HVD1_PD - HVD Power Down in VDD1 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS1_HVD1_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_HVD1_PD_SHIFT)) & PMC_PDCFGSTATUS1_HVD1_PD_MASK)

#define PMC_PDCFGSTATUS1_AGDET1_PD_MASK          (0x40U)
#define PMC_PDCFGSTATUS1_AGDET1_PD_SHIFT         (6U)
/*! AGDET1_PD - AGDET Power Down in VDD1 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS1_AGDET1_PD(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_AGDET1_PD_SHIFT)) & PMC_PDCFGSTATUS1_AGDET1_PD_MASK)

#define PMC_PDCFGSTATUS1_POR2_LP_MASK            (0x80U)
#define PMC_PDCFGSTATUS1_POR2_LP_SHIFT           (7U)
/*! POR2_LP - POR Low Power in VDD2 Domain
 *  0b0..High power
 *  0b1..Low power
 */
#define PMC_PDCFGSTATUS1_POR2_LP(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_POR2_LP_SHIFT)) & PMC_PDCFGSTATUS1_POR2_LP_MASK)

#define PMC_PDCFGSTATUS1_LVD2_LP_MASK            (0x100U)
#define PMC_PDCFGSTATUS1_LVD2_LP_SHIFT           (8U)
/*! LVD2_LP - LVD Low Power in VDD2 Domain
 *  0b1..Low power
 *  0b0..High power
 */
#define PMC_PDCFGSTATUS1_LVD2_LP(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_LVD2_LP_SHIFT)) & PMC_PDCFGSTATUS1_LVD2_LP_MASK)

#define PMC_PDCFGSTATUS1_HVD2_PD_MASK            (0x200U)
#define PMC_PDCFGSTATUS1_HVD2_PD_SHIFT           (9U)
/*! HVD2_PD - HVD Power Down in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS1_HVD2_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_HVD2_PD_SHIFT)) & PMC_PDCFGSTATUS1_HVD2_PD_MASK)

#define PMC_PDCFGSTATUS1_AGDET2_PD_MASK          (0x400U)
#define PMC_PDCFGSTATUS1_AGDET2_PD_SHIFT         (10U)
/*! AGDET2_PD - AGDET Power Down in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS1_AGDET2_PD(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_AGDET2_PD_SHIFT)) & PMC_PDCFGSTATUS1_AGDET2_PD_MASK)

#define PMC_PDCFGSTATUS1_PORN_LP_MASK            (0x800U)
#define PMC_PDCFGSTATUS1_PORN_LP_SHIFT           (11U)
/*! PORN_LP - POR Low Power in VDDN Domain
 *  0b0..High power
 *  0b1..Low power
 */
#define PMC_PDCFGSTATUS1_PORN_LP(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_PORN_LP_SHIFT)) & PMC_PDCFGSTATUS1_PORN_LP_MASK)

#define PMC_PDCFGSTATUS1_LVDN_LP_MASK            (0x1000U)
#define PMC_PDCFGSTATUS1_LVDN_LP_SHIFT           (12U)
/*! LVDN_LP - LVD Low Power in VDDN Domain
 *  0b0..High power
 *  0b1..Low power
 */
#define PMC_PDCFGSTATUS1_LVDN_LP(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_LVDN_LP_SHIFT)) & PMC_PDCFGSTATUS1_LVDN_LP_MASK)

#define PMC_PDCFGSTATUS1_HVDN_PD_MASK            (0x2000U)
#define PMC_PDCFGSTATUS1_HVDN_PD_SHIFT           (13U)
/*! HVDN_PD - HVD Power Down in VDDN Domain
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS1_HVDN_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_HVDN_PD_SHIFT)) & PMC_PDCFGSTATUS1_HVDN_PD_MASK)

#define PMC_PDCFGSTATUS1_OTP_PD_MASK             (0x8000U)
#define PMC_PDCFGSTATUS1_OTP_PD_SHIFT            (15U)
/*! OTP_PD - OTP Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS1_OTP_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_OTP_PD_SHIFT)) & PMC_PDCFGSTATUS1_OTP_PD_MASK)

#define PMC_PDCFGSTATUS1_ROM_PD_MASK             (0x10000U)
#define PMC_PDCFGSTATUS1_ROM_PD_SHIFT            (16U)
/*! ROM_PD - ROM Power Down
 *  0b1..Power down
 *  0b0..Power on
 */
#define PMC_PDCFGSTATUS1_ROM_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_ROM_PD_SHIFT)) & PMC_PDCFGSTATUS1_ROM_PD_MASK)

#define PMC_PDCFGSTATUS1_SRAMSLEEP_MASK          (0x80000000U)
#define PMC_PDCFGSTATUS1_SRAMSLEEP_SHIFT         (31U)
/*! SRAMSLEEP - SRAM Sleep Mode
 *  0b0..Normal
 *  0b1..Sleep
 */
#define PMC_PDCFGSTATUS1_SRAMSLEEP(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS1_SRAMSLEEP_SHIFT)) & PMC_PDCFGSTATUS1_SRAMSLEEP_MASK)
/*! @} */

/*! @name PDCFGSTATUS2 - PD Configuration Status 2 */
/*! @{ */

#define PMC_PDCFGSTATUS2_SRAM0_MASK              (0x1U)
#define PMC_PDCFGSTATUS2_SRAM0_SHIFT             (0U)
/*! SRAM0 - RAM Partition 0 Array Power Down
 *  0b1..Array and periphery were powered down
 *  0b0..Array was powered on
 */
#define PMC_PDCFGSTATUS2_SRAM0(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM0_SHIFT)) & PMC_PDCFGSTATUS2_SRAM0_MASK)

#define PMC_PDCFGSTATUS2_SRAM1_MASK              (0x2U)
#define PMC_PDCFGSTATUS2_SRAM1_SHIFT             (1U)
/*! SRAM1 - RAM Partition 1 Array Power Down
 *  0b1..Array and periphery were powered down
 *  0b0..Array was powered on
 */
#define PMC_PDCFGSTATUS2_SRAM1(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM1_SHIFT)) & PMC_PDCFGSTATUS2_SRAM1_MASK)

#define PMC_PDCFGSTATUS2_SRAM2_MASK              (0x4U)
#define PMC_PDCFGSTATUS2_SRAM2_SHIFT             (2U)
/*! SRAM2 - RAM Partition 2 Array Power Down
 *  0b1..Array and periphery were powered down
 *  0b0..Array was powered on
 */
#define PMC_PDCFGSTATUS2_SRAM2(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM2_SHIFT)) & PMC_PDCFGSTATUS2_SRAM2_MASK)

#define PMC_PDCFGSTATUS2_SRAM3_MASK              (0x8U)
#define PMC_PDCFGSTATUS2_SRAM3_SHIFT             (3U)
/*! SRAM3 - RAM Partition 3 Array Power Down
 *  0b1..Array and periphery were powered down
 *  0b0..Array was powered on
 */
#define PMC_PDCFGSTATUS2_SRAM3(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM3_SHIFT)) & PMC_PDCFGSTATUS2_SRAM3_MASK)

#define PMC_PDCFGSTATUS2_SRAM4_MASK              (0x10U)
#define PMC_PDCFGSTATUS2_SRAM4_SHIFT             (4U)
/*! SRAM4 - RAM Partition 4 Array Power Down
 *  0b1..Array and periphery were powered down
 *  0b0..Array was powered on
 */
#define PMC_PDCFGSTATUS2_SRAM4(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM4_SHIFT)) & PMC_PDCFGSTATUS2_SRAM4_MASK)

#define PMC_PDCFGSTATUS2_SRAM5_MASK              (0x20U)
#define PMC_PDCFGSTATUS2_SRAM5_SHIFT             (5U)
/*! SRAM5 - RAM Partition 5 Array Power Down
 *  0b1..Array and periphery were powered down
 *  0b0..Array was powered on
 */
#define PMC_PDCFGSTATUS2_SRAM5(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM5_SHIFT)) & PMC_PDCFGSTATUS2_SRAM5_MASK)

