nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
/*! @name PDCFGSTATUS5 - PD Configuration Status 5 */
/*! @{ */

#define PMC_PDCFGSTATUS5_SDHC0_SRAM_MASK         (0x1U)
#define PMC_PDCFGSTATUS5_SDHC0_SRAM_SHIFT        (0U)
/*! SDHC0_SRAM - uSDHC0 RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_SDHC0_SRAM(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_SDHC0_SRAM_SHIFT)) & PMC_PDCFGSTATUS5_SDHC0_SRAM_MASK)

#define PMC_PDCFGSTATUS5_SDHC1_SRAM_MASK         (0x2U)
#define PMC_PDCFGSTATUS5_SDHC1_SRAM_SHIFT        (1U)
/*! SDHC1_SRAM - uSDHC1 RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_SDHC1_SRAM(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_SDHC1_SRAM_SHIFT)) & PMC_PDCFGSTATUS5_SDHC1_SRAM_MASK)

#define PMC_PDCFGSTATUS5_USB0_SRAM_MASK          (0x4U)
#define PMC_PDCFGSTATUS5_USB0_SRAM_SHIFT         (2U)
/*! USB0_SRAM - USB0 RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_USB0_SRAM(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_USB0_SRAM_SHIFT)) & PMC_PDCFGSTATUS5_USB0_SRAM_MASK)

#define PMC_PDCFGSTATUS5_USB1_SRAM_MASK          (0x8U)
#define PMC_PDCFGSTATUS5_USB1_SRAM_SHIFT         (3U)
/*! USB1_SRAM - USB1 RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_USB1_SRAM(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_USB1_SRAM_SHIFT)) & PMC_PDCFGSTATUS5_USB1_SRAM_MASK)

#define PMC_PDCFGSTATUS5_JPEG_MASK               (0x10U)
#define PMC_PDCFGSTATUS5_JPEG_SHIFT              (4U)
/*! JPEG - JPEGDEC RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_JPEG(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_JPEG_SHIFT)) & PMC_PDCFGSTATUS5_JPEG_MASK)

#define PMC_PDCFGSTATUS5_PNG_MASK                (0x20U)
#define PMC_PDCFGSTATUS5_PNG_SHIFT               (5U)
/*! PNG - PNGDEC RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_PNG(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_PNG_SHIFT)) & PMC_PDCFGSTATUS5_PNG_MASK)

#define PMC_PDCFGSTATUS5_MIPI_MASK               (0x40U)
#define PMC_PDCFGSTATUS5_MIPI_SHIFT              (6U)
/*! MIPI - MIPI PHY RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_MIPI(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_MIPI_SHIFT)) & PMC_PDCFGSTATUS5_MIPI_MASK)

#define PMC_PDCFGSTATUS5_GPU_MASK                (0x80U)
#define PMC_PDCFGSTATUS5_GPU_SHIFT               (7U)
/*! GPU - VGPU RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_GPU(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_GPU_SHIFT)) & PMC_PDCFGSTATUS5_GPU_MASK)

#define PMC_PDCFGSTATUS5_DMA2_3_MASK             (0x100U)
#define PMC_PDCFGSTATUS5_DMA2_3_SHIFT            (8U)
/*! DMA2_3 - DMA2 and DMA3 RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_DMA2_3(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_DMA2_3_SHIFT)) & PMC_PDCFGSTATUS5_DMA2_3_MASK)

#define PMC_PDCFGSTATUS5_DMA0_1_P_E_MASK         (0x200U)
#define PMC_PDCFGSTATUS5_DMA0_1_P_E_SHIFT        (9U)
/*! DMA0_1_P_E - DMA0-1, PKC, and ETF RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_DMA0_1_P_E(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_DMA0_1_P_E_SHIFT)) & PMC_PDCFGSTATUS5_DMA0_1_P_E_MASK)

#define PMC_PDCFGSTATUS5_CPU0_CCACHE_MASK        (0x400U)
#define PMC_PDCFGSTATUS5_CPU0_CCACHE_SHIFT       (10U)
/*! CPU0_CCACHE - CPU0 Code Cache RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_CPU0_CCACHE(x)          (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_CPU0_CCACHE_SHIFT)) & PMC_PDCFGSTATUS5_CPU0_CCACHE_MASK)

#define PMC_PDCFGSTATUS5_CPU0_SCACHE_MASK        (0x800U)
#define PMC_PDCFGSTATUS5_CPU0_SCACHE_SHIFT       (11U)
/*! CPU0_SCACHE - CPU0 System Cache RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_CPU0_SCACHE(x)          (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_CPU0_SCACHE_SHIFT)) & PMC_PDCFGSTATUS5_CPU0_SCACHE_MASK)

#define PMC_PDCFGSTATUS5_DSP_ICACHE_MASK         (0x1000U)
#define PMC_PDCFGSTATUS5_DSP_ICACHE_SHIFT        (12U)
/*! DSP_ICACHE - HiFi4 Instruction Cache RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_DSP_ICACHE(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_DSP_ICACHE_SHIFT)) & PMC_PDCFGSTATUS5_DSP_ICACHE_MASK)

#define PMC_PDCFGSTATUS5_DSP_DCACHE_MASK         (0x2000U)
#define PMC_PDCFGSTATUS5_DSP_DCACHE_SHIFT        (13U)
/*! DSP_DCACHE - HiFi4 Data Cache RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_DSP_DCACHE(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_DSP_DCACHE_SHIFT)) & PMC_PDCFGSTATUS5_DSP_DCACHE_MASK)

#define PMC_PDCFGSTATUS5_DSP_ITCM_MASK           (0x4000U)
#define PMC_PDCFGSTATUS5_DSP_ITCM_SHIFT          (14U)
/*! DSP_ITCM - HiFi4 Instruction TCM RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_DSP_ITCM(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_DSP_ITCM_SHIFT)) & PMC_PDCFGSTATUS5_DSP_ITCM_MASK)

#define PMC_PDCFGSTATUS5_DSP_DTCM_MASK           (0x8000U)
#define PMC_PDCFGSTATUS5_DSP_DTCM_SHIFT          (15U)
/*! DSP_DTCM - HiFi4 Data TCM RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_DSP_DTCM(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_DSP_DTCM_SHIFT)) & PMC_PDCFGSTATUS5_DSP_DTCM_MASK)

#define PMC_PDCFGSTATUS5_EZH_TCM_MASK            (0x10000U)
#define PMC_PDCFGSTATUS5_EZH_TCM_SHIFT           (16U)
/*! EZH_TCM - EZH-V TCM RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_EZH_TCM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_EZH_TCM_SHIFT)) & PMC_PDCFGSTATUS5_EZH_TCM_MASK)

#define PMC_PDCFGSTATUS5_NPU_MASK                (0x20000U)
#define PMC_PDCFGSTATUS5_NPU_SHIFT               (17U)
/*! NPU - NPU RAMs Periphery
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDCFGSTATUS5_NPU(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS5_NPU_SHIFT)) & PMC_PDCFGSTATUS5_NPU_MASK)

