nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
/*! @name CNT_CTRL_CLR - Count Control Clear */
/*! @{ */

#define PNGDEC_CNT_CTRL_CLR_CNT_CTRL_CLR_MASK    (0x1U)
#define PNGDEC_CNT_CTRL_CLR_CNT_CTRL_CLR_SHIFT   (0U)
/*! CNT_CTRL_CLR - Count Control Clear
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_CNT_CTRL_CLR_CNT_CTRL_CLR(x)      (((uint32_t)(((uint32_t)(x)) << PNGDEC_CNT_CTRL_CLR_CNT_CTRL_CLR_SHIFT)) & PNGDEC_CNT_CTRL_CLR_CNT_CTRL_CLR_MASK)
/*! @} */

/*! @name ENC_DATA_DMA_SRC_ADDR - Encode Data Source Address */
/*! @{ */

#define PNGDEC_ENC_DATA_DMA_SRC_ADDR_SRC_ADDR_MASK (0xFFFFFFFFU)
#define PNGDEC_ENC_DATA_DMA_SRC_ADDR_SRC_ADDR_SHIFT (0U)
/*! SRC_ADDR - Source Address */
#define PNGDEC_ENC_DATA_DMA_SRC_ADDR_SRC_ADDR(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_ENC_DATA_DMA_SRC_ADDR_SRC_ADDR_SHIFT)) & PNGDEC_ENC_DATA_DMA_SRC_ADDR_SRC_ADDR_MASK)
/*! @} */

/*! @name ENC_DATA_DMA_SRC_LEN - Encode Data Source Length */
/*! @{ */

#define PNGDEC_ENC_DATA_DMA_SRC_LEN_SRC_LEN_MASK (0xFFFFFFFFU)
#define PNGDEC_ENC_DATA_DMA_SRC_LEN_SRC_LEN_SHIFT (0U)
/*! SRC_LEN - Source Length */
#define PNGDEC_ENC_DATA_DMA_SRC_LEN_SRC_LEN(x)   (((uint32_t)(((uint32_t)(x)) << PNGDEC_ENC_DATA_DMA_SRC_LEN_SRC_LEN_SHIFT)) & PNGDEC_ENC_DATA_DMA_SRC_LEN_SRC_LEN_MASK)
/*! @} */

/*! @name DEC_PIXEL_DMA_DES_ADDR - Decode Pixel Destination Address */
/*! @{ */

#define PNGDEC_DEC_PIXEL_DMA_DES_ADDR_PIXEL_DES_ADDR_MASK (0xFFFFFFFFU)
#define PNGDEC_DEC_PIXEL_DMA_DES_ADDR_PIXEL_DES_ADDR_SHIFT (0U)
/*! PIXEL_DES_ADDR - Pixel Destination Address */
#define PNGDEC_DEC_PIXEL_DMA_DES_ADDR_PIXEL_DES_ADDR(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_PIXEL_DMA_DES_ADDR_PIXEL_DES_ADDR_SHIFT)) & PNGDEC_DEC_PIXEL_DMA_DES_ADDR_PIXEL_DES_ADDR_MASK)
/*! @} */

/*! @name DEC_PIXEL_DMA_DES_LEN - Decode Pixel Destination Length */
/*! @{ */

#define PNGDEC_DEC_PIXEL_DMA_DES_LEN_PIXEL_DES_LEN_MASK (0xFFFFFFFFU)
#define PNGDEC_DEC_PIXEL_DMA_DES_LEN_PIXEL_DES_LEN_SHIFT (0U)
/*! PIXEL_DES_LEN - Pixel Destination Length */
#define PNGDEC_DEC_PIXEL_DMA_DES_LEN_PIXEL_DES_LEN(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_PIXEL_DMA_DES_LEN_PIXEL_DES_LEN_SHIFT)) & PNGDEC_DEC_PIXEL_DMA_DES_LEN_PIXEL_DES_LEN_MASK)
/*! @} */

/*! @name DEC_ANC_DMA_DES_ADDR - Decode Ancillary Destination Address */
/*! @{ */

#define PNGDEC_DEC_ANC_DMA_DES_ADDR_ANC_DES_ADDR_MASK (0xFFFFFFFFU)
#define PNGDEC_DEC_ANC_DMA_DES_ADDR_ANC_DES_ADDR_SHIFT (0U)
/*! ANC_DES_ADDR - Ancillary Destination Address */
#define PNGDEC_DEC_ANC_DMA_DES_ADDR_ANC_DES_ADDR(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_ANC_DMA_DES_ADDR_ANC_DES_ADDR_SHIFT)) & PNGDEC_DEC_ANC_DMA_DES_ADDR_ANC_DES_ADDR_MASK)
/*! @} */

/*! @name DEC_ANC_DMA_DES_LEN - Decode Ancillary Destination Length */
/*! @{ */

#define PNGDEC_DEC_ANC_DMA_DES_LEN_ANC_DES_LEN_MASK (0xFFFFFFFFU)
#define PNGDEC_DEC_ANC_DMA_DES_LEN_ANC_DES_LEN_SHIFT (0U)
/*! ANC_DES_LEN - Ancillary Destination Length */
#define PNGDEC_DEC_ANC_DMA_DES_LEN_ANC_DES_LEN(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_ANC_DMA_DES_LEN_ANC_DES_LEN_SHIFT)) & PNGDEC_DEC_ANC_DMA_DES_LEN_ANC_DES_LEN_MASK)
/*! @} */

/*! @name DEC_INT_STS - Decode Interrupt Status */
/*! @{ */

#define PNGDEC_DEC_INT_STS_ERR_ADLER_MASK        (0x1U)
#define PNGDEC_DEC_INT_STS_ERR_ADLER_SHIFT       (0U)
/*! ERR_ADLER - ADLER-32 Checksum Error
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_ERR_ADLER(x)          (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_ERR_ADLER_SHIFT)) & PNGDEC_DEC_INT_STS_ERR_ADLER_MASK)

#define PNGDEC_DEC_INT_STS_ERR_CRC_MASK          (0x2U)
#define PNGDEC_DEC_INT_STS_ERR_CRC_SHIFT         (1U)
/*! ERR_CRC - CRC Error
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_ERR_CRC(x)            (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_ERR_CRC_SHIFT)) & PNGDEC_DEC_INT_STS_ERR_CRC_MASK)

#define PNGDEC_DEC_INT_STS_ERR_PNG_HEADER_MASK   (0x4U)
#define PNGDEC_DEC_INT_STS_ERR_PNG_HEADER_SHIFT  (2U)
/*! ERR_PNG_HEADER - PNG Header Error
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_ERR_PNG_HEADER(x)     (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_ERR_PNG_HEADER_SHIFT)) & PNGDEC_DEC_INT_STS_ERR_PNG_HEADER_MASK)

#define PNGDEC_DEC_INT_STS_ERR_BTYPE_MASK        (0x8U)
#define PNGDEC_DEC_INT_STS_ERR_BTYPE_SHIFT       (3U)
/*! ERR_BTYPE - B-type Error (Block Encoding Type Error in IDAT Chunk)
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_ERR_BTYPE(x)          (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_ERR_BTYPE_SHIFT)) & PNGDEC_DEC_INT_STS_ERR_BTYPE_MASK)

#define PNGDEC_DEC_INT_STS_ERR_ZLIB_HEADER_MASK  (0x10U)
#define PNGDEC_DEC_INT_STS_ERR_ZLIB_HEADER_SHIFT (4U)
/*! ERR_ZLIB_HEADER - Zlib Header Error
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_ERR_ZLIB_HEADER(x)    (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_ERR_ZLIB_HEADER_SHIFT)) & PNGDEC_DEC_INT_STS_ERR_ZLIB_HEADER_MASK)

#define PNGDEC_DEC_INT_STS_ERR_BITDEPTH_MASK     (0x20U)
#define PNGDEC_DEC_INT_STS_ERR_BITDEPTH_SHIFT    (5U)
/*! ERR_BITDEPTH - Bit Depth Error
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_ERR_BITDEPTH(x)       (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_ERR_BITDEPTH_SHIFT)) & PNGDEC_DEC_INT_STS_ERR_BITDEPTH_MASK)

#define PNGDEC_DEC_INT_STS_ERR_INTERLACE_MASK    (0x40U)
#define PNGDEC_DEC_INT_STS_ERR_INTERLACE_SHIFT   (6U)
/*! ERR_INTERLACE - Interlace Error
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_ERR_INTERLACE(x)      (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_ERR_INTERLACE_SHIFT)) & PNGDEC_DEC_INT_STS_ERR_INTERLACE_MASK)

#define PNGDEC_DEC_INT_STS_ERR_WIDTH_MASK        (0x80U)
#define PNGDEC_DEC_INT_STS_ERR_WIDTH_SHIFT       (7U)
/*! ERR_WIDTH - Width Error
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_ERR_WIDTH(x)          (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_ERR_WIDTH_SHIFT)) & PNGDEC_DEC_INT_STS_ERR_WIDTH_MASK)

#define PNGDEC_DEC_INT_STS_ENC_DATA_DMA_DONE_MASK (0x100U)
#define PNGDEC_DEC_INT_STS_ENC_DATA_DMA_DONE_SHIFT (8U)
/*! ENC_DATA_DMA_DONE - Encoded Data and DMA Copy Done
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_ENC_DATA_DMA_DONE(x)  (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_ENC_DATA_DMA_DONE_SHIFT)) & PNGDEC_DEC_INT_STS_ENC_DATA_DMA_DONE_MASK)

#define PNGDEC_DEC_INT_STS_DEC_PIXEL_DMA_DONE_MASK (0x200U)
#define PNGDEC_DEC_INT_STS_DEC_PIXEL_DMA_DONE_SHIFT (9U)
/*! DEC_PIXEL_DMA_DONE - Decode Pixel and DMA Copy Done
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_DEC_PIXEL_DMA_DONE(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_DEC_PIXEL_DMA_DONE_SHIFT)) & PNGDEC_DEC_INT_STS_DEC_PIXEL_DMA_DONE_MASK)

#define PNGDEC_DEC_INT_STS_DEC_ANC_DMA_DONE_MASK (0x400U)
#define PNGDEC_DEC_INT_STS_DEC_ANC_DMA_DONE_SHIFT (10U)
/*! DEC_ANC_DMA_DONE - Ancillary Decode and DMA Copy Done Flag
 *  0b0..No interrupt occurred.
 *  0b1..Interrupt occurred.
 *  0b0..No effect
 *  0b1..Clears status flag.
 */
#define PNGDEC_DEC_INT_STS_DEC_ANC_DMA_DONE(x)   (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_DEC_ANC_DMA_DONE_SHIFT)) & PNGDEC_DEC_INT_STS_DEC_ANC_DMA_DONE_MASK)
/*! @} */

/*! @name DEC_INT_STS_EN - Interrupt Enable */
/*! @{ */

#define PNGDEC_DEC_INT_STS_EN_ERR_ADLER_EN_MASK  (0x1U)
#define PNGDEC_DEC_INT_STS_EN_ERR_ADLER_EN_SHIFT (0U)
/*! ERR_ADLER_EN - ADLER-32 Checksum Error Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_DEC_INT_STS_EN_ERR_ADLER_EN(x)    (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_EN_ERR_ADLER_EN_SHIFT)) & PNGDEC_DEC_INT_STS_EN_ERR_ADLER_EN_MASK)

#define PNGDEC_DEC_INT_STS_EN_ERR_CRC_EN_MASK    (0x2U)
#define PNGDEC_DEC_INT_STS_EN_ERR_CRC_EN_SHIFT   (1U)
/*! ERR_CRC_EN - CRC Error Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_DEC_INT_STS_EN_ERR_CRC_EN(x)      (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_EN_ERR_CRC_EN_SHIFT)) & PNGDEC_DEC_INT_STS_EN_ERR_CRC_EN_MASK)

#define PNGDEC_DEC_INT_STS_EN_ERR_PNG_HEADER_EN_MASK (0x4U)
#define PNGDEC_DEC_INT_STS_EN_ERR_PNG_HEADER_EN_SHIFT (2U)
/*! ERR_PNG_HEADER_EN - PNG Header Error Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_DEC_INT_STS_EN_ERR_PNG_HEADER_EN(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_EN_ERR_PNG_HEADER_EN_SHIFT)) & PNGDEC_DEC_INT_STS_EN_ERR_PNG_HEADER_EN_MASK)

#define PNGDEC_DEC_INT_STS_EN_ERR_BTYPE_EN_MASK  (0x8U)
#define PNGDEC_DEC_INT_STS_EN_ERR_BTYPE_EN_SHIFT (3U)
/*! ERR_BTYPE_EN - B-Type Error Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_DEC_INT_STS_EN_ERR_BTYPE_EN(x)    (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_EN_ERR_BTYPE_EN_SHIFT)) & PNGDEC_DEC_INT_STS_EN_ERR_BTYPE_EN_MASK)

#define PNGDEC_DEC_INT_STS_EN_ERR_ZLIB_HEADER_EN_MASK (0x10U)
#define PNGDEC_DEC_INT_STS_EN_ERR_ZLIB_HEADER_EN_SHIFT (4U)
/*! ERR_ZLIB_HEADER_EN - Zlib Header Error Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_DEC_INT_STS_EN_ERR_ZLIB_HEADER_EN(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_EN_ERR_ZLIB_HEADER_EN_SHIFT)) & PNGDEC_DEC_INT_STS_EN_ERR_ZLIB_HEADER_EN_MASK)

#define PNGDEC_DEC_INT_STS_EN_ERR_BITDEPTH_EN_MASK (0x20U)
#define PNGDEC_DEC_INT_STS_EN_ERR_BITDEPTH_EN_SHIFT (5U)
/*! ERR_BITDEPTH_EN - Bit Depth Error Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_DEC_INT_STS_EN_ERR_BITDEPTH_EN(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_EN_ERR_BITDEPTH_EN_SHIFT)) & PNGDEC_DEC_INT_STS_EN_ERR_BITDEPTH_EN_MASK)

#define PNGDEC_DEC_INT_STS_EN_ERR_INTERLACE_EN_MASK (0x40U)
#define PNGDEC_DEC_INT_STS_EN_ERR_INTERLACE_EN_SHIFT (6U)
/*! ERR_INTERLACE_EN - Interlace Error Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_DEC_INT_STS_EN_ERR_INTERLACE_EN(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_EN_ERR_INTERLACE_EN_SHIFT)) & PNGDEC_DEC_INT_STS_EN_ERR_INTERLACE_EN_MASK)

#define PNGDEC_DEC_INT_STS_EN_ERR_WIDTH_EN_MASK  (0x80U)
#define PNGDEC_DEC_INT_STS_EN_ERR_WIDTH_EN_SHIFT (7U)
/*! ERR_WIDTH_EN - Width Error Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_DEC_INT_STS_EN_ERR_WIDTH_EN(x)    (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_EN_ERR_WIDTH_EN_SHIFT)) & PNGDEC_DEC_INT_STS_EN_ERR_WIDTH_EN_MASK)

#define PNGDEC_DEC_INT_STS_EN_ENC_DATA_DMA_DONE_EN_MASK (0x100U)
#define PNGDEC_DEC_INT_STS_EN_ENC_DATA_DMA_DONE_EN_SHIFT (8U)
/*! ENC_DATA_DMA_DONE_EN - Encoded Data and DMA Copy Done Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_DEC_INT_STS_EN_ENC_DATA_DMA_DONE_EN(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_EN_ENC_DATA_DMA_DONE_EN_SHIFT)) & PNGDEC_DEC_INT_STS_EN_ENC_DATA_DMA_DONE_EN_MASK)

#define PNGDEC_DEC_INT_STS_EN_DEC_PIXEL_DMA_DONE_EN_MASK (0x200U)
#define PNGDEC_DEC_INT_STS_EN_DEC_PIXEL_DMA_DONE_EN_SHIFT (9U)
/*! DEC_PIXEL_DMA_DONE_EN - Decode Pixel and DMA Copy Done Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define PNGDEC_DEC_INT_STS_EN_DEC_PIXEL_DMA_DONE_EN(x) (((uint32_t)(((uint32_t)(x)) << PNGDEC_DEC_INT_STS_EN_DEC_PIXEL_DMA_DONE_EN_SHIFT)) & PNGDEC_DEC_INT_STS_EN_DEC_PIXEL_DMA_DONE_EN_MASK)

