nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
#define RSTCTL3_SYSRSTSTAT_WWDT0_RESET_MASK      (0x40U)
#define RSTCTL3_SYSRSTSTAT_WWDT0_RESET_SHIFT     (6U)
/*! WWDT0_RESET - WWDT0 Reset
 *  0b0..No WWDT0 reset event is detected.
 *  0b1..WWDT0 reset event is detected.
 */
#define RSTCTL3_SYSRSTSTAT_WWDT0_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_SYSRSTSTAT_WWDT0_RESET_SHIFT)) & RSTCTL3_SYSRSTSTAT_WWDT0_RESET_MASK)

#define RSTCTL3_SYSRSTSTAT_WWDT1_RESET_MASK      (0x80U)
#define RSTCTL3_SYSRSTSTAT_WWDT1_RESET_SHIFT     (7U)
/*! WWDT1_RESET - WWDT1 Reset
 *  0b0..No WWDT1 reset event is detected
 *  0b1..WWDT1 reset event is detected.
 */
#define RSTCTL3_SYSRSTSTAT_WWDT1_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_SYSRSTSTAT_WWDT1_RESET_SHIFT)) & RSTCTL3_SYSRSTSTAT_WWDT1_RESET_MASK)

#define RSTCTL3_SYSRSTSTAT_WWDT2_RESET_MASK      (0x100U)
#define RSTCTL3_SYSRSTSTAT_WWDT2_RESET_SHIFT     (8U)
/*! WWDT2_RESET - WWDT2 Reset
 *  0b0..No WWDT2 reset event is detected.
 *  0b1..WWDT2 reset event is detected.
 */
#define RSTCTL3_SYSRSTSTAT_WWDT2_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_SYSRSTSTAT_WWDT2_RESET_SHIFT)) & RSTCTL3_SYSRSTSTAT_WWDT2_RESET_MASK)

#define RSTCTL3_SYSRSTSTAT_WWDT3_RESET_MASK      (0x200U)
#define RSTCTL3_SYSRSTSTAT_WWDT3_RESET_SHIFT     (9U)
/*! WWDT3_RESET - WWDT3 Reset
 *  0b0..No WWDT3 reset event is detected.
 *  0b1..WWDT3 reset event is detected.
 */
#define RSTCTL3_SYSRSTSTAT_WWDT3_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_SYSRSTSTAT_WWDT3_RESET_SHIFT)) & RSTCTL3_SYSRSTSTAT_WWDT3_RESET_MASK)

#define RSTCTL3_SYSRSTSTAT_CDOG0_RESET_MASK      (0x400U)
#define RSTCTL3_SYSRSTSTAT_CDOG0_RESET_SHIFT     (10U)
/*! CDOG0_RESET - CDOG0 Reset
 *  0b0..No CDOG0 reset event is detected.
 *  0b1..CDOG0 reset event is detected.
 */
#define RSTCTL3_SYSRSTSTAT_CDOG0_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_SYSRSTSTAT_CDOG0_RESET_SHIFT)) & RSTCTL3_SYSRSTSTAT_CDOG0_RESET_MASK)

#define RSTCTL3_SYSRSTSTAT_CDOG1_RESET_MASK      (0x800U)
#define RSTCTL3_SYSRSTSTAT_CDOG1_RESET_SHIFT     (11U)
/*! CDOG1_RESET - CDOG1 Reset
 *  0b0..No CDOG1 reset event is detected.
 *  0b1..CDOG1 reset event is detected.
 */
#define RSTCTL3_SYSRSTSTAT_CDOG1_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_SYSRSTSTAT_CDOG1_RESET_SHIFT)) & RSTCTL3_SYSRSTSTAT_CDOG1_RESET_MASK)

#define RSTCTL3_SYSRSTSTAT_CDOG2_RESET_MASK      (0x1000U)
#define RSTCTL3_SYSRSTSTAT_CDOG2_RESET_SHIFT     (12U)
/*! CDOG2_RESET - CDOG2 Reset
 *  0b0..No CDOG2 reset event is detected.
 *  0b1..CDOG2 reset event is detected.
 */
#define RSTCTL3_SYSRSTSTAT_CDOG2_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_SYSRSTSTAT_CDOG2_RESET_SHIFT)) & RSTCTL3_SYSRSTSTAT_CDOG2_RESET_MASK)

#define RSTCTL3_SYSRSTSTAT_CDOG3_RESET_MASK      (0x2000U)
#define RSTCTL3_SYSRSTSTAT_CDOG3_RESET_SHIFT     (13U)
/*! CDOG3_RESET - CDOG3 Reset
 *  0b0..No CDOG3 reset event is detected.
 *  0b1..CDOG3 reset event is detected.
 */
#define RSTCTL3_SYSRSTSTAT_CDOG3_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_SYSRSTSTAT_CDOG3_RESET_SHIFT)) & RSTCTL3_SYSRSTSTAT_CDOG3_RESET_MASK)

#define RSTCTL3_SYSRSTSTAT_CDOG4_RESET_MASK      (0x4000U)
#define RSTCTL3_SYSRSTSTAT_CDOG4_RESET_SHIFT     (14U)
/*! CDOG4_RESET - CDOG4 Reset
 *  0b0..No CDOG4 reset event is detected.
 *  0b1..CDOG4 reset event is detected.
 */
#define RSTCTL3_SYSRSTSTAT_CDOG4_RESET(x)        (((uint32_t)(((uint32_t)(x)) << RSTCTL3_SYSRSTSTAT_CDOG4_RESET_SHIFT)) & RSTCTL3_SYSRSTSTAT_CDOG4_RESET_MASK)
/*! @} */

/*! @name DOMRSTSTAT - Domain Reset Status */
/*! @{ */

#define RSTCTL3_DOMRSTSTAT_VDD1_SENSE_STAT_MASK  (0x1U)
#define RSTCTL3_DOMRSTSTAT_VDD1_SENSE_STAT_SHIFT (0U)
/*! VDD1_SENSE_STAT - VDD1_SENSE Domain Reset State
 *  0b0..The domain is in reset state.
 *  0b1..The domain is in normal run state.
 */
#define RSTCTL3_DOMRSTSTAT_VDD1_SENSE_STAT(x)    (((uint32_t)(((uint32_t)(x)) << RSTCTL3_DOMRSTSTAT_VDD1_SENSE_STAT_SHIFT)) & RSTCTL3_DOMRSTSTAT_VDD1_SENSE_STAT_MASK)

#define RSTCTL3_DOMRSTSTAT_COM2_STAT_MASK        (0x2U)
#define RSTCTL3_DOMRSTSTAT_COM2_STAT_SHIFT       (1U)
/*! COM2_STAT - VDD2_COM (Main) Domain Reset State
 *  0b0..The domain is in reset state.
 *  0b1..The domain is in normal run state.
 */
#define RSTCTL3_DOMRSTSTAT_COM2_STAT(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL3_DOMRSTSTAT_COM2_STAT_SHIFT)) & RSTCTL3_DOMRSTSTAT_COM2_STAT_MASK)

#define RSTCTL3_DOMRSTSTAT_COMN_STAT_MASK        (0x4U)
#define RSTCTL3_DOMRSTSTAT_COMN_STAT_SHIFT       (2U)
/*! COMN_STAT - VDDN_COM Domain Reset State
 *  0b0..The domain is in reset state.
 *  0b1..The domain is in normal run state.
 */
#define RSTCTL3_DOMRSTSTAT_COMN_STAT(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL3_DOMRSTSTAT_COMN_STAT_SHIFT)) & RSTCTL3_DOMRSTSTAT_COMN_STAT_MASK)

#define RSTCTL3_DOMRSTSTAT_COMP_STAT_MASK        (0x8U)
#define RSTCTL3_DOMRSTSTAT_COMP_STAT_SHIFT       (3U)
/*! COMP_STAT - VDD2_COMP Domain Reset State
 *  0b0..The domain is in reset state.
 *  0b1..The domain is in normal run state.
 */
#define RSTCTL3_DOMRSTSTAT_COMP_STAT(x)          (((uint32_t)(((uint32_t)(x)) << RSTCTL3_DOMRSTSTAT_COMP_STAT_SHIFT)) & RSTCTL3_DOMRSTSTAT_COMP_STAT_MASK)

#define RSTCTL3_DOMRSTSTAT_DSP_STAT_MASK         (0x10U)
#define RSTCTL3_DOMRSTSTAT_DSP_STAT_SHIFT        (4U)
/*! DSP_STAT - VDD2_DSP Domain Reset State
 *  0b0..The domain is in reset state.
 *  0b1..The domain is in normal run state.
 */
#define RSTCTL3_DOMRSTSTAT_DSP_STAT(x)           (((uint32_t)(((uint32_t)(x)) << RSTCTL3_DOMRSTSTAT_DSP_STAT_SHIFT)) & RSTCTL3_DOMRSTSTAT_DSP_STAT_MASK)

#define RSTCTL3_DOMRSTSTAT_MEDIA_STAT_MASK       (0x20U)
#define RSTCTL3_DOMRSTSTAT_MEDIA_STAT_SHIFT      (5U)
/*! MEDIA_STAT - VDD2_MEDIA Domain Reset State
 *  0b0..The domain is in reset state.
 *  0b1..The domain is in normal run state.
 */
#define RSTCTL3_DOMRSTSTAT_MEDIA_STAT(x)         (((uint32_t)(((uint32_t)(x)) << RSTCTL3_DOMRSTSTAT_MEDIA_STAT_SHIFT)) & RSTCTL3_DOMRSTSTAT_MEDIA_STAT_MASK)
/*! @} */

/*! @name PRSTCTL0 - Sense Domain Peripheral Reset Control 0 */
/*! @{ */

#define RSTCTL3_PRSTCTL0_IOPCTL1_MASK            (0x1U)
#define RSTCTL3_PRSTCTL0_IOPCTL1_SHIFT           (0U)
/*! IOPCTL1 - IOPCTL1 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL0_IOPCTL1(x)              (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL0_IOPCTL1_SHIFT)) & RSTCTL3_PRSTCTL0_IOPCTL1_MASK)

#define RSTCTL3_PRSTCTL0_CPU1_MASK               (0x80000000U)
#define RSTCTL3_PRSTCTL0_CPU1_SHIFT              (31U)
/*! CPU1 - CPU1 Reset
 *  0b0..Clears reset.
 *  0b1..Sets reset.
 */
#define RSTCTL3_PRSTCTL0_CPU1(x)                 (((uint32_t)(((uint32_t)(x)) << RSTCTL3_PRSTCTL0_CPU1_SHIFT)) & RSTCTL3_PRSTCTL0_CPU1_MASK)
/*! @} */

/*! @name PRSTCTL1 - Sense Domain Peripheral Reset Control 1 */
/*! @{ */

