nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
#define SLEEPCON1_WAKEUPEN0_RTC1_WKUP_MASK       (0x1000000U)
#define SLEEPCON1_WAKEUPEN0_RTC1_WKUP_SHIFT      (24U)
/*! RTC1_WKUP - RTC1_WKUP Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_RTC1_WKUP(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_RTC1_WKUP_SHIFT)) & SLEEPCON1_WAKEUPEN0_RTC1_WKUP_MASK)

#define SLEEPCON1_WAKEUPEN0_MU1_MUB_MASK         (0x4000000U)
#define SLEEPCON1_WAKEUPEN0_MU1_MUB_SHIFT        (26U)
/*! MU1_MUB - MU1_MUB Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_MU1_MUB(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_MU1_MUB_SHIFT)) & SLEEPCON1_WAKEUPEN0_MU1_MUB_MASK)

#define SLEEPCON1_WAKEUPEN0_MU2_MUB_MASK         (0x8000000U)
#define SLEEPCON1_WAKEUPEN0_MU2_MUB_SHIFT        (27U)
/*! MU2_MUB - MU2_MUB Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_MU2_MUB(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_MU2_MUB_SHIFT)) & SLEEPCON1_WAKEUPEN0_MU2_MUB_MASK)

#define SLEEPCON1_WAKEUPEN0_MU3_MUA_MASK         (0x10000000U)
#define SLEEPCON1_WAKEUPEN0_MU3_MUA_SHIFT        (28U)
/*! MU3_MUA - MU3_MUA Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_MU3_MUA(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_MU3_MUA_SHIFT)) & SLEEPCON1_WAKEUPEN0_MU3_MUA_MASK)

#define SLEEPCON1_WAKEUPEN0_PMC1_MASK            (0x20000000U)
#define SLEEPCON1_WAKEUPEN0_PMC1_SHIFT           (29U)
/*! PMC1 - PMC1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_PMC1(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_PMC1_SHIFT)) & SLEEPCON1_WAKEUPEN0_PMC1_MASK)

#define SLEEPCON1_WAKEUPEN0_OSTIMER_MASK         (0x40000000U)
#define SLEEPCON1_WAKEUPEN0_OSTIMER_SHIFT        (30U)
/*! OSTIMER - OSTIMER Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN0_OSTIMER(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_OSTIMER_SHIFT)) & SLEEPCON1_WAKEUPEN0_OSTIMER_MASK)
/*! @} */

/*! @name WAKEUPEN1 - Wakeup Enable 1 */
/*! @{ */

#define SLEEPCON1_WAKEUPEN1_I3C2_MASK            (0x2U)
#define SLEEPCON1_WAKEUPEN1_I3C2_SHIFT           (1U)
/*! I3C2 - I3C2 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_I3C2(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_I3C2_SHIFT)) & SLEEPCON1_WAKEUPEN1_I3C2_MASK)

#define SLEEPCON1_WAKEUPEN1_USB0_MASK            (0x4U)
#define SLEEPCON1_WAKEUPEN1_USB0_SHIFT           (2U)
/*! USB0 - USB0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_USB0(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_USB0_SHIFT)) & SLEEPCON1_WAKEUPEN1_USB0_MASK)

#define SLEEPCON1_WAKEUPEN1_USB1_MASK            (0x8U)
#define SLEEPCON1_WAKEUPEN1_USB1_SHIFT           (3U)
/*! USB1 - USB1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_USB1(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_USB1_SHIFT)) & SLEEPCON1_WAKEUPEN1_USB1_MASK)

#define SLEEPCON1_WAKEUPEN1_WWDT2_MASK           (0x10U)
#define SLEEPCON1_WAKEUPEN1_WWDT2_SHIFT          (4U)
/*! WWDT2 - WWDT2 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_WWDT2(x)             (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_WWDT2_SHIFT)) & SLEEPCON1_WAKEUPEN1_WWDT2_MASK)

#define SLEEPCON1_WAKEUPEN1_WWDT3_MASK           (0x20U)
#define SLEEPCON1_WAKEUPEN1_WWDT3_SHIFT          (5U)
/*! WWDT3 - WWDT3 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_WWDT3(x)             (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_WWDT3_SHIFT)) & SLEEPCON1_WAKEUPEN1_WWDT3_MASK)

#define SLEEPCON1_WAKEUPEN1_USBPHY0_MASK         (0x40U)
#define SLEEPCON1_WAKEUPEN1_USBPHY0_SHIFT        (6U)
/*! USBPHY0 - USBPHY0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_USBPHY0(x)           (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_USBPHY0_SHIFT)) & SLEEPCON1_WAKEUPEN1_USBPHY0_MASK)

#define SLEEPCON1_WAKEUPEN1_PMIC_IRQN_MASK       (0x80U)
#define SLEEPCON1_WAKEUPEN1_PMIC_IRQN_SHIFT      (7U)
/*! PMIC_IRQN - PMIC_IRQN Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_PMIC_IRQN(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_PMIC_IRQN_SHIFT)) & SLEEPCON1_WAKEUPEN1_PMIC_IRQN_MASK)

#define SLEEPCON1_WAKEUPEN1_I3C3_MASK            (0x100U)
#define SLEEPCON1_WAKEUPEN1_I3C3_SHIFT           (8U)
/*! I3C3 - I3C3 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_I3C3(x)              (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_I3C3_SHIFT)) & SLEEPCON1_WAKEUPEN1_I3C3_MASK)

#define SLEEPCON1_WAKEUPEN1_FLEXIO_MASK          (0x200U)
#define SLEEPCON1_WAKEUPEN1_FLEXIO_SHIFT         (9U)
/*! FLEXIO - FLEXIO Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_FLEXIO(x)            (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_FLEXIO_SHIFT)) & SLEEPCON1_WAKEUPEN1_FLEXIO_MASK)

#define SLEEPCON1_WAKEUPEN1_EDMA2_CH0_MASK       (0x2000U)
#define SLEEPCON1_WAKEUPEN1_EDMA2_CH0_SHIFT      (13U)
/*! EDMA2_CH0 - eDMA2 Channel 0 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_EDMA2_CH0(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_EDMA2_CH0_SHIFT)) & SLEEPCON1_WAKEUPEN1_EDMA2_CH0_MASK)

#define SLEEPCON1_WAKEUPEN1_EDMA2_CH1_MASK       (0x4000U)
#define SLEEPCON1_WAKEUPEN1_EDMA2_CH1_SHIFT      (14U)
/*! EDMA2_CH1 - eDMA2 Channel 1 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_EDMA2_CH1(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_EDMA2_CH1_SHIFT)) & SLEEPCON1_WAKEUPEN1_EDMA2_CH1_MASK)

#define SLEEPCON1_WAKEUPEN1_EDMA2_CH2_MASK       (0x8000U)
#define SLEEPCON1_WAKEUPEN1_EDMA2_CH2_SHIFT      (15U)
/*! EDMA2_CH2 - eDMA2 Channel 2 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_EDMA2_CH2(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_EDMA2_CH2_SHIFT)) & SLEEPCON1_WAKEUPEN1_EDMA2_CH2_MASK)

#define SLEEPCON1_WAKEUPEN1_EDMA2_CH3_MASK       (0x10000U)
#define SLEEPCON1_WAKEUPEN1_EDMA2_CH3_SHIFT      (16U)
/*! EDMA2_CH3 - eDMA2 Channel 3 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_EDMA2_CH3(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_EDMA2_CH3_SHIFT)) & SLEEPCON1_WAKEUPEN1_EDMA2_CH3_MASK)

#define SLEEPCON1_WAKEUPEN1_EDMA2_CH4_MASK       (0x20000U)
#define SLEEPCON1_WAKEUPEN1_EDMA2_CH4_SHIFT      (17U)
/*! EDMA2_CH4 - eDMA2 Channel 4 Wake-up Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SLEEPCON1_WAKEUPEN1_EDMA2_CH4(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_EDMA2_CH4_SHIFT)) & SLEEPCON1_WAKEUPEN1_EDMA2_CH4_MASK)

