nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
#define SLEEPCON1_WAKEUPEN0_SET_PMC1_MASK        (0x20000000U)
#define SLEEPCON1_WAKEUPEN0_SET_PMC1_SHIFT       (29U)
/*! PMC1 - PMC1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_PMC1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_PMC1_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_PMC1_MASK)

#define SLEEPCON1_WAKEUPEN0_SET_OSTIMER_MASK     (0x40000000U)
#define SLEEPCON1_WAKEUPEN0_SET_OSTIMER_SHIFT    (30U)
/*! OSTIMER - OSTIMER Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN0_SET_OSTIMER(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN0_SET_OSTIMER_SHIFT)) & SLEEPCON1_WAKEUPEN0_SET_OSTIMER_MASK)
/*! @} */

/*! @name WAKEUPEN1_SET - Wakeup Enable 1 Set */
/*! @{ */

#define SLEEPCON1_WAKEUPEN1_SET_I3C2_MASK        (0x2U)
#define SLEEPCON1_WAKEUPEN1_SET_I3C2_SHIFT       (1U)
/*! I3C2 - I3C2 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_I3C2(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_I3C2_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_I3C2_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_USB0_MASK        (0x4U)
#define SLEEPCON1_WAKEUPEN1_SET_USB0_SHIFT       (2U)
/*! USB0 - USB0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_USB0(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_USB0_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_USB0_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_USB1_MASK        (0x8U)
#define SLEEPCON1_WAKEUPEN1_SET_USB1_SHIFT       (3U)
/*! USB1 - USB1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_USB1(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_USB1_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_USB1_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_WWDT2_MASK       (0x10U)
#define SLEEPCON1_WAKEUPEN1_SET_WWDT2_SHIFT      (4U)
/*! WWDT2 - WWDT2 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_WWDT2(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_WWDT2_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_WWDT2_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_WWDT3_MASK       (0x20U)
#define SLEEPCON1_WAKEUPEN1_SET_WWDT3_SHIFT      (5U)
/*! WWDT3 - WWDT3 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_WWDT3(x)         (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_WWDT3_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_WWDT3_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_USBPHY0_MASK     (0x40U)
#define SLEEPCON1_WAKEUPEN1_SET_USBPHY0_SHIFT    (6U)
/*! USBPHY0 - USBPHY0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_USBPHY0(x)       (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_USBPHY0_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_USBPHY0_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_PMIC_IRQN_MASK   (0x80U)
#define SLEEPCON1_WAKEUPEN1_SET_PMIC_IRQN_SHIFT  (7U)
/*! PMIC_IRQN - PMIC_IRQN Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_PMIC_IRQN(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_PMIC_IRQN_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_PMIC_IRQN_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_I3C3_MASK        (0x100U)
#define SLEEPCON1_WAKEUPEN1_SET_I3C3_SHIFT       (8U)
/*! I3C3 - I3C3 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_I3C3(x)          (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_I3C3_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_I3C3_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_FLEXIO_MASK      (0x200U)
#define SLEEPCON1_WAKEUPEN1_SET_FLEXIO_SHIFT     (9U)
/*! FLEXIO - FLEXIO Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_FLEXIO(x)        (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_FLEXIO_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_FLEXIO_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH0_MASK   (0x2000U)
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH0_SHIFT  (13U)
/*! EDMA2_CH0 - eDMA2 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH0_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH0_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH1_MASK   (0x4000U)
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH1_SHIFT  (14U)
/*! EDMA2_CH1 - eDMA2 Channel 1 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH1(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH1_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH1_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH2_MASK   (0x8000U)
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH2_SHIFT  (15U)
/*! EDMA2_CH2 - eDMA2 Channel 2 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH2(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH2_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH2_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH3_MASK   (0x10000U)
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH3_SHIFT  (16U)
/*! EDMA2_CH3 - eDMA2 Channel 3 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH3(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH3_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH3_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH4_MASK   (0x20000U)
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH4_SHIFT  (17U)
/*! EDMA2_CH4 - eDMA2 Channel 4 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH4(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH4_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH4_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH5_MASK   (0x40000U)
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH5_SHIFT  (18U)
/*! EDMA2_CH5 - eDMA2 Channel 5 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH5(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH5_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH5_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH6_MASK   (0x80000U)
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH6_SHIFT  (19U)
/*! EDMA2_CH6 - eDMA2 Channel 6 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH6(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH6_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH6_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH7_MASK   (0x100000U)
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH7_SHIFT  (20U)
/*! EDMA2_CH7 - eDMA2 Channel 7 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH7(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH7_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_EDMA2_CH7_MASK)

#define SLEEPCON1_WAKEUPEN1_SET_EDMA3_CH0_MASK   (0x200000U)
#define SLEEPCON1_WAKEUPEN1_SET_EDMA3_CH0_SHIFT  (21U)
/*! EDMA3_CH0 - eDMA3 Channel 0 Wake-up Enable Set
 *  0b0..No effect
 *  0b1..Sets the bit
 */
#define SLEEPCON1_WAKEUPEN1_SET_EDMA3_CH0(x)     (((uint32_t)(((uint32_t)(x)) << SLEEPCON1_WAKEUPEN1_SET_EDMA3_CH0_SHIFT)) & SLEEPCON1_WAKEUPEN1_SET_EDMA3_CH0_MASK)

