nxp-mcuxpresso/mcux-sdk/devices/MIMXRT758S/MIMXRT758S_cm33_core1.h
#define SYSCON3_GDET_CTRL_GDET_ERR_CLR_MASK      (0x2U)
#define SYSCON3_GDET_CTRL_GDET_ERR_CLR_SHIFT     (1U)
/*! GDET_ERR_CLR - GDET Error Clear
 *  0b1..Clears
 *  0b0..Not clear
 */
#define SYSCON3_GDET_CTRL_GDET_ERR_CLR(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON3_GDET_CTRL_GDET_ERR_CLR_SHIFT)) & SYSCON3_GDET_CTRL_GDET_ERR_CLR_MASK)

#define SYSCON3_GDET_CTRL_GDET_ISO_SW_MASK       (0xCU)
#define SYSCON3_GDET_CTRL_GDET_ISO_SW_SHIFT      (2U)
/*! GDET_ISO_SW - GDET Isolation Control
 *  0b00..Disabled
 *  0b01..Disabled
 *  0b10..Enabled
 *  0b11..Disabled
 */
#define SYSCON3_GDET_CTRL_GDET_ISO_SW(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON3_GDET_CTRL_GDET_ISO_SW_SHIFT)) & SYSCON3_GDET_CTRL_GDET_ISO_SW_MASK)

#define SYSCON3_GDET_CTRL_EVENT_CNT_MASK         (0xFF0000U)
#define SYSCON3_GDET_CTRL_EVENT_CNT_SHIFT        (16U)
/*! EVENT_CNT - Event Count Value */
#define SYSCON3_GDET_CTRL_EVENT_CNT(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON3_GDET_CTRL_EVENT_CNT_SHIFT)) & SYSCON3_GDET_CTRL_EVENT_CNT_MASK)

#define SYSCON3_GDET_CTRL_POS_SYNC_MASK          (0x1000000U)
#define SYSCON3_GDET_CTRL_POS_SYNC_SHIFT         (24U)
/*! POS_SYNC - Positive Glitch Detection
 *  0b0..Not detected
 *  0b1..Detected
 */
#define SYSCON3_GDET_CTRL_POS_SYNC(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON3_GDET_CTRL_POS_SYNC_SHIFT)) & SYSCON3_GDET_CTRL_POS_SYNC_MASK)

#define SYSCON3_GDET_CTRL_NEG_SYNC_MASK          (0x2000000U)
#define SYSCON3_GDET_CTRL_NEG_SYNC_SHIFT         (25U)
/*! NEG_SYNC - Negative Glitch Detection
 *  0b0..Not detected
 *  0b1..Detected
 */
#define SYSCON3_GDET_CTRL_NEG_SYNC(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON3_GDET_CTRL_NEG_SYNC_SHIFT)) & SYSCON3_GDET_CTRL_NEG_SYNC_MASK)

#define SYSCON3_GDET_CTRL_EVENT_CLR_FLAG_MASK    (0x4000000U)
#define SYSCON3_GDET_CTRL_EVENT_CLR_FLAG_SHIFT   (26U)
/*! EVENT_CLR_FLAG - Event Counter Clear
 *  0b0..Not cleared
 *  0b1..Cleared
 */
#define SYSCON3_GDET_CTRL_EVENT_CLR_FLAG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON3_GDET_CTRL_EVENT_CLR_FLAG_SHIFT)) & SYSCON3_GDET_CTRL_EVENT_CLR_FLAG_MASK)
/*! @} */

/* The count of SYSCON3_GDET_CTRL */
#define SYSCON3_GDET_CTRL_COUNT                  (2U)

/*! @name RXEVPULSEGEN - Receive Event Pulse Generator */
/*! @{ */

#define SYSCON3_RXEVPULSEGEN_RXEVPULSEGEN_MASK   (0x1U)
#define SYSCON3_RXEVPULSEGEN_RXEVPULSEGEN_SHIFT  (0U)
/*! RXEVPULSEGEN - Receive Event Pulse Generator
 *  0b0..No effect
 *  0b1..Pulse receive event high for one cycle
 */
#define SYSCON3_RXEVPULSEGEN_RXEVPULSEGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON3_RXEVPULSEGEN_RXEVPULSEGEN_SHIFT)) & SYSCON3_RXEVPULSEGEN_RXEVPULSEGEN_MASK)
/*! @} */

/*! @name CPU_STATUS - CPU Status */
/*! @{ */

#define SYSCON3_CPU_STATUS_CPU_WAIT_MASK         (0x1U)
#define SYSCON3_CPU_STATUS_CPU_WAIT_SHIFT        (0U)
/*! CPU_WAIT - CPU1 Stall
 *  0b1..Stall
 *  0b0..No stall
 */
#define SYSCON3_CPU_STATUS_CPU_WAIT(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON3_CPU_STATUS_CPU_WAIT_SHIFT)) & SYSCON3_CPU_STATUS_CPU_WAIT_MASK)

#define SYSCON3_CPU_STATUS_CPU_LOCKUP_MASK       (0x2U)
#define SYSCON3_CPU_STATUS_CPU_LOCKUP_SHIFT      (1U)
/*! CPU_LOCKUP - CPU1 Lockup State
 *  0b1..In lockup
 *  0b0..Not in lockup
 */
#define SYSCON3_CPU_STATUS_CPU_LOCKUP(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON3_CPU_STATUS_CPU_LOCKUP_SHIFT)) & SYSCON3_CPU_STATUS_CPU_LOCKUP_MASK)
/*! @} */

/*! @name CPU1_SVTOR - CPU1 Secure Vector Table Offset */
/*! @{ */

#define SYSCON3_CPU1_SVTOR_CPU1_SVTOR_MASK       (0x1FFFFFFU)
#define SYSCON3_CPU1_SVTOR_CPU1_SVTOR_SHIFT      (0U)
/*! CPU1_SVTOR - Secure Vector Table Offset */
#define SYSCON3_CPU1_SVTOR_CPU1_SVTOR(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON3_CPU1_SVTOR_CPU1_SVTOR_SHIFT)) & SYSCON3_CPU1_SVTOR_CPU1_SVTOR_MASK)
/*! @} */

/*! @name CPU1_NSVTOR - CPU1 Non-Secure Vector Table Offset */
/*! @{ */

#define SYSCON3_CPU1_NSVTOR_CPU1_NSVTOR_MASK     (0x1FFFFFFU)
#define SYSCON3_CPU1_NSVTOR_CPU1_NSVTOR_SHIFT    (0U)
/*! CPU1_NSVTOR - Non-Secure Vector Table Offset */
#define SYSCON3_CPU1_NSVTOR_CPU1_NSVTOR(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON3_CPU1_NSVTOR_CPU1_NSVTOR_SHIFT)) & SYSCON3_CPU1_NSVTOR_CPU1_NSVTOR_MASK)
/*! @} */

/*! @name SILICONREV_ID - Silicon Revision ID */
/*! @{ */

#define SYSCON3_SILICONREV_ID_MINOR_MASK         (0xFU)
#define SYSCON3_SILICONREV_ID_MINOR_SHIFT        (0U)
/*! MINOR - Silicon Revision Minor Tag */
#define SYSCON3_SILICONREV_ID_MINOR(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON3_SILICONREV_ID_MINOR_SHIFT)) & SYSCON3_SILICONREV_ID_MINOR_MASK)

#define SYSCON3_SILICONREV_ID_MAJOR_MASK         (0xF0000U)
#define SYSCON3_SILICONREV_ID_MAJOR_SHIFT        (16U)
/*! MAJOR - Silicon Revision Major Tag */
#define SYSCON3_SILICONREV_ID_MAJOR(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON3_SILICONREV_ID_MAJOR_SHIFT)) & SYSCON3_SILICONREV_ID_MAJOR_MASK)
/*! @} */

/*! @name AUTOCLKGATEOVERRIDE0 - Automatic Clock Gate Override */
/*! @{ */

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION18_MASK (0x1U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION18_SHIFT (0U)
/*! PARTITION18 - Partition 18
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION18(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION18_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION18_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION19_MASK (0x2U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION19_SHIFT (1U)
/*! PARTITION19 - Partition 19
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION19(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION19_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION19_MASK)

#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION20_MASK (0x4U)
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION20_SHIFT (2U)
/*! PARTITION20 - Partition 20
 *  0b0..Enables clock gating
 *  0b1..Continuous clocking
 */
#define SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION20(x) (((uint32_t)(((uint32_t)(x)) << SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION20_SHIFT)) & SYSCON3_AUTOCLKGATEOVERRIDE0_PARTITION20_MASK)

